Contents of the .debug_info.dwo section:

  Compilation Unit @ offset 0x0:
   Length:        0x4189 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indexed string: 0x1d4): GNU C17 9.3.0 -mtune=generic -march=x86-64 -g3 -gsplit-dwarf -fno-eliminate-unused-debug-types -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <e>   DW_AT_language    : 12	(ANSI C99)
    <f>   DW_AT_name        : (indexed string: 0x6b5): lj_dwarf.c
    <11>   DW_AT_comp_dir    : (indexed string: 0xe80): /home/mrottenkolber/snabb/lib/luajit/src
    <13>   DW_AT_GNU_macros  : 0x0
    <17>   DW_AT_GNU_dwo_id  : 0xc27a7a6dbf96f4bb
 <1><1f>: Abbrev Number: 2 (DW_TAG_typedef)
    <20>   DW_AT_name        : (indexed string: 0xc63): __gnuc_va_list
    <22>   DW_AT_decl_file   : 2
    <23>   DW_AT_decl_line   : 40
    <24>   DW_AT_decl_column : 27
    <25>   DW_AT_type        : <0x29>
 <1><29>: Abbrev Number: 3 (DW_TAG_typedef)
    <2a>   DW_AT_name        : (indexed string: 0xcfb): __builtin_va_list
    <2c>   DW_AT_type        : <0x30>
 <1><30>: Abbrev Number: 4 (DW_TAG_array_type)
    <31>   DW_AT_type        : <0x44>
    <35>   DW_AT_sibling     : <0x40>
 <2><39>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <3a>   DW_AT_type        : <0x40>
    <3e>   DW_AT_upper_bound : 0
 <2><3f>: Abbrev Number: 0
 <1><40>: Abbrev Number: 6 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 8
    <42>   DW_AT_encoding    : 7	(unsigned)
    <43>   DW_AT_name        : (indexed string: 0x36): long unsigned int
 <1><44>: Abbrev Number: 7 (DW_TAG_structure_type)
    <45>   DW_AT_name        : (indexed string: 0x113): __va_list_tag
    <47>   DW_AT_byte_size   : 24
    <48>   DW_AT_decl_file   : 1
    <49>   DW_AT_decl_line   : 0
    <4a>   DW_AT_sibling     : <0x77>
 <2><4e>: Abbrev Number: 8 (DW_TAG_member)
    <4f>   DW_AT_name        : (indexed string: 0x702): gp_offset
    <51>   DW_AT_decl_file   : 1
    <52>   DW_AT_decl_line   : 0
    <53>   DW_AT_type        : <0x77>
    <57>   DW_AT_data_member_location: 0
 <2><58>: Abbrev Number: 8 (DW_TAG_member)
    <59>   DW_AT_name        : (indexed string: 0x8b1): fp_offset
    <5b>   DW_AT_decl_file   : 1
    <5c>   DW_AT_decl_line   : 0
    <5d>   DW_AT_type        : <0x77>
    <61>   DW_AT_data_member_location: 4
 <2><62>: Abbrev Number: 8 (DW_TAG_member)
    <63>   DW_AT_name        : (indexed string: 0xed6): overflow_arg_area
    <65>   DW_AT_decl_file   : 1
    <66>   DW_AT_decl_line   : 0
    <67>   DW_AT_type        : <0x7c>
    <6b>   DW_AT_data_member_location: 8
 <2><6c>: Abbrev Number: 8 (DW_TAG_member)
    <6d>   DW_AT_name        : (indexed string: 0xed8): reg_save_area
    <6f>   DW_AT_decl_file   : 1
    <70>   DW_AT_decl_line   : 0
    <71>   DW_AT_type        : <0x7c>
    <75>   DW_AT_data_member_location: 16
 <2><76>: Abbrev Number: 0
 <1><77>: Abbrev Number: 6 (DW_TAG_base_type)
    <78>   DW_AT_byte_size   : 4
    <79>   DW_AT_encoding    : 7	(unsigned)
    <7a>   DW_AT_name        : (indexed string: 0xfd6): unsigned int
 <1><7c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <7d>   DW_AT_byte_size   : 8
 <1><7e>: Abbrev Number: 2 (DW_TAG_typedef)
    <7f>   DW_AT_name        : (indexed string: 0xd77): va_list
    <81>   DW_AT_decl_file   : 2
    <82>   DW_AT_decl_line   : 99
    <83>   DW_AT_decl_column : 24
    <84>   DW_AT_type        : <0x1f>
 <1><88>: Abbrev Number: 2 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indexed string: 0xd43): ptrdiff_t
    <8b>   DW_AT_decl_file   : 3
    <8c>   DW_AT_decl_line   : 143
    <8d>   DW_AT_decl_column : 26
    <8e>   DW_AT_type        : <0x92>
 <1><92>: Abbrev Number: 6 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 8
    <94>   DW_AT_encoding    : 5	(signed)
    <95>   DW_AT_name        : (indexed string: 0xb15): long int
 <1><97>: Abbrev Number: 2 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indexed string: 0x22c): size_t
    <9a>   DW_AT_decl_file   : 3
    <9b>   DW_AT_decl_line   : 209
    <9c>   DW_AT_decl_column : 23
    <9d>   DW_AT_type        : <0x40>
 <1><a1>: Abbrev Number: 10 (DW_TAG_typedef)
    <a2>   DW_AT_name        : (indexed string: 0xa01): wchar_t
    <a4>   DW_AT_decl_file   : 3
    <a5>   DW_AT_decl_line   : 321
    <a7>   DW_AT_decl_column : 24
    <a8>   DW_AT_type        : <0xac>
 <1><ac>: Abbrev Number: 11 (DW_TAG_base_type)
    <ad>   DW_AT_byte_size   : 4
    <ae>   DW_AT_encoding    : 5	(signed)
    <af>   DW_AT_name        : int
 <1><b3>: Abbrev Number: 12 (DW_TAG_const_type)
    <b4>   DW_AT_type        : <0xac>
 <1><b8>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <be>   DW_AT_byte_size   : 32
    <bf>   DW_AT_alignment   : 16
    <c0>   DW_AT_decl_file   : 3
    <c1>   DW_AT_decl_line   : 415
    <c3>   DW_AT_decl_column : 9
    <c4>   DW_AT_sibling     : <0xe3>
 <2><c8>: Abbrev Number: 15 (DW_TAG_member)
    <c9>   DW_AT_name        : (indexed string: 0xbac): __max_align_ll
    <cb>   DW_AT_decl_file   : 3
    <cc>   DW_AT_decl_line   : 416
    <ce>   DW_AT_decl_column : 13
    <cf>   DW_AT_type        : <0xe3>
    <d3>   DW_AT_alignment   : 8
    <d4>   DW_AT_data_member_location: 0
 <2><d5>: Abbrev Number: 15 (DW_TAG_member)
    <d6>   DW_AT_name        : (indexed string: 0xba6): __max_align_ld
    <d8>   DW_AT_decl_file   : 3
    <d9>   DW_AT_decl_line   : 417
    <db>   DW_AT_decl_column : 15
    <dc>   DW_AT_type        : <0xe7>
    <e0>   DW_AT_alignment   : 16
    <e1>   DW_AT_data_member_location: 16
 <2><e2>: Abbrev Number: 0
 <1><e3>: Abbrev Number: 6 (DW_TAG_base_type)
    <e4>   DW_AT_byte_size   : 8
    <e5>   DW_AT_encoding    : 5	(signed)
    <e6>   DW_AT_name        : (indexed string: 0x2): long long int
 <1><e7>: Abbrev Number: 6 (DW_TAG_base_type)
    <e8>   DW_AT_byte_size   : 16
    <e9>   DW_AT_encoding    : 4	(float)
    <ea>   DW_AT_name        : (indexed string: 0x14a): long double
 <1><ec>: Abbrev Number: 16 (DW_TAG_typedef)
    <ed>   DW_AT_name        : (indexed string: 0x1ec): max_align_t
    <ef>   DW_AT_decl_file   : 3
    <f0>   DW_AT_decl_line   : 426
    <f2>   DW_AT_decl_column : 3
    <f3>   DW_AT_type        : <0xbd>
    <f7>   DW_AT_alignment   : 16
 <1><f8>: Abbrev Number: 2 (DW_TAG_typedef)
    <f9>   DW_AT_name        : (indexed string: 0x97d): lua_State
    <fb>   DW_AT_decl_file   : 4
    <fc>   DW_AT_decl_line   : 51
    <fd>   DW_AT_decl_column : 26
    <fe>   DW_AT_type        : <0x102>
 <1><102>: Abbrev Number: 17 (DW_TAG_structure_type)
    <103>   DW_AT_name        : (indexed string: 0x97d): lua_State
    <105>   DW_AT_byte_size   : 96
    <106>   DW_AT_decl_file   : 5
    <107>   DW_AT_decl_line   : 576
    <109>   DW_AT_decl_column : 8
    <10a>   DW_AT_sibling     : <0x1c9>
 <2><10e>: Abbrev Number: 18 (DW_TAG_member)
    <10f>   DW_AT_name        : (indexed string: 0xcd3): nextgc
    <111>   DW_AT_decl_file   : 5
    <112>   DW_AT_decl_line   : 577
    <114>   DW_AT_decl_column : 3
    <115>   DW_AT_type        : <0x109e>
    <119>   DW_AT_data_member_location: 0
 <2><11a>: Abbrev Number: 18 (DW_TAG_member)
    <11b>   DW_AT_name        : (indexed string: 0x9b9): marked
    <11d>   DW_AT_decl_file   : 5
    <11e>   DW_AT_decl_line   : 577
    <120>   DW_AT_decl_column : 3
    <121>   DW_AT_type        : <0x65e>
    <125>   DW_AT_data_member_location: 8
 <2><126>: Abbrev Number: 19 (DW_TAG_member)
    <127>   DW_AT_name        : gct
    <12b>   DW_AT_decl_file   : 5
    <12c>   DW_AT_decl_line   : 577
    <12e>   DW_AT_decl_column : 3
    <12f>   DW_AT_type        : <0x65e>
    <133>   DW_AT_data_member_location: 9
 <2><134>: Abbrev Number: 18 (DW_TAG_member)
    <135>   DW_AT_name        : (indexed string: 0xda1): dummy_ffid
    <137>   DW_AT_decl_file   : 5
    <138>   DW_AT_decl_line   : 578
    <13a>   DW_AT_decl_column : 11
    <13b>   DW_AT_type        : <0x65e>
    <13f>   DW_AT_data_member_location: 10
 <2><140>: Abbrev Number: 18 (DW_TAG_member)
    <141>   DW_AT_name        : (indexed string: 0xb43): status
    <143>   DW_AT_decl_file   : 5
    <144>   DW_AT_decl_line   : 579
    <146>   DW_AT_decl_column : 11
    <147>   DW_AT_type        : <0x65e>
    <14b>   DW_AT_data_member_location: 11
 <2><14c>: Abbrev Number: 18 (DW_TAG_member)
    <14d>   DW_AT_name        : (indexed string: 0xa46): glref
    <14f>   DW_AT_decl_file   : 5
    <150>   DW_AT_decl_line   : 580
    <152>   DW_AT_decl_column : 8
    <153>   DW_AT_type        : <0x1094>
    <157>   DW_AT_data_member_location: 16
 <2><158>: Abbrev Number: 18 (DW_TAG_member)
    <159>   DW_AT_name        : (indexed string: 0xc2a): gclist
    <15b>   DW_AT_decl_file   : 5
    <15c>   DW_AT_decl_line   : 581
    <15e>   DW_AT_decl_column : 9
    <15f>   DW_AT_type        : <0x109e>
    <163>   DW_AT_data_member_location: 24
 <2><164>: Abbrev Number: 18 (DW_TAG_member)
    <165>   DW_AT_name        : (indexed string: 0x772): base
    <167>   DW_AT_decl_file   : 5
    <168>   DW_AT_decl_line   : 582
    <16a>   DW_AT_decl_column : 11
    <16b>   DW_AT_type        : <0x1bf6>
    <16f>   DW_AT_data_member_location: 32
 <2><170>: Abbrev Number: 19 (DW_TAG_member)
    <171>   DW_AT_name        : top
    <175>   DW_AT_decl_file   : 5
    <176>   DW_AT_decl_line   : 583
    <178>   DW_AT_decl_column : 11
    <179>   DW_AT_type        : <0x1bf6>
    <17d>   DW_AT_data_member_location: 40
 <2><17e>: Abbrev Number: 18 (DW_TAG_member)
    <17f>   DW_AT_name        : (indexed string: 0xe36): maxstack
    <181>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 584
    <184>   DW_AT_decl_column : 8
    <185>   DW_AT_type        : <0x1094>
    <189>   DW_AT_data_member_location: 48
 <2><18a>: Abbrev Number: 18 (DW_TAG_member)
    <18b>   DW_AT_name        : (indexed string: 0x906): stack
    <18d>   DW_AT_decl_file   : 5
    <18e>   DW_AT_decl_line   : 585
    <190>   DW_AT_decl_column : 8
    <191>   DW_AT_type        : <0x1094>
    <195>   DW_AT_data_member_location: 56
 <2><196>: Abbrev Number: 18 (DW_TAG_member)
    <197>   DW_AT_name        : (indexed string: 0x7e8): openupval
    <199>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 586
    <19c>   DW_AT_decl_column : 9
    <19d>   DW_AT_type        : <0x109e>
    <1a1>   DW_AT_data_member_location: 64
 <2><1a2>: Abbrev Number: 19 (DW_TAG_member)
    <1a3>   DW_AT_name        : env
    <1a7>   DW_AT_decl_file   : 5
    <1a8>   DW_AT_decl_line   : 587
    <1aa>   DW_AT_decl_column : 9
    <1ab>   DW_AT_type        : <0x109e>
    <1af>   DW_AT_data_member_location: 72
 <2><1b0>: Abbrev Number: 18 (DW_TAG_member)
    <1b1>   DW_AT_name        : (indexed string: 0xd9e): cframe
    <1b3>   DW_AT_decl_file   : 5
    <1b4>   DW_AT_decl_line   : 588
    <1b6>   DW_AT_decl_column : 9
    <1b7>   DW_AT_type        : <0x7c>
    <1bb>   DW_AT_data_member_location: 80
 <2><1bc>: Abbrev Number: 18 (DW_TAG_member)
    <1bd>   DW_AT_name        : (indexed string: 0xd67): stacksize
    <1bf>   DW_AT_decl_file   : 5
    <1c0>   DW_AT_decl_line   : 589
    <1c2>   DW_AT_decl_column : 9
    <1c3>   DW_AT_type        : <0x1080>
    <1c7>   DW_AT_data_member_location: 88
 <2><1c8>: Abbrev Number: 0
 <1><1c9>: Abbrev Number: 2 (DW_TAG_typedef)
    <1ca>   DW_AT_name        : (indexed string: 0x6ed): lua_CFunction
    <1cc>   DW_AT_decl_file   : 4
    <1cd>   DW_AT_decl_line   : 53
    <1ce>   DW_AT_decl_column : 15
    <1cf>   DW_AT_type        : <0x1d3>
 <1><1d3>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <1d4>   DW_AT_byte_size   : 8
    <1d5>   DW_AT_type        : <0x1d9>
 <1><1d9>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <1da>   DW_AT_prototyped  : 1
    <1da>   DW_AT_type        : <0xac>
    <1de>   DW_AT_sibling     : <0x1e8>
 <2><1e2>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1e3>   DW_AT_type        : <0x1e8>
 <2><1e7>: Abbrev Number: 0
 <1><1e8>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <1e9>   DW_AT_byte_size   : 8
    <1ea>   DW_AT_type        : <0xf8>
 <1><1ee>: Abbrev Number: 2 (DW_TAG_typedef)
    <1ef>   DW_AT_name        : (indexed string: 0xf4): lua_Reader
    <1f1>   DW_AT_decl_file   : 4
    <1f2>   DW_AT_decl_line   : 59
    <1f3>   DW_AT_decl_column : 24
    <1f4>   DW_AT_type        : <0x1f8>
 <1><1f8>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <1f9>   DW_AT_byte_size   : 8
    <1fa>   DW_AT_type        : <0x1fe>
 <1><1fe>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <1ff>   DW_AT_prototyped  : 1
    <1ff>   DW_AT_type        : <0x217>
    <203>   DW_AT_sibling     : <0x217>
 <2><207>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <208>   DW_AT_type        : <0x1e8>
 <2><20c>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <20d>   DW_AT_type        : <0x7c>
 <2><211>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <212>   DW_AT_type        : <0x22c>
 <2><216>: Abbrev Number: 0
 <1><217>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <218>   DW_AT_byte_size   : 8
    <219>   DW_AT_type        : <0x227>
 <1><21d>: Abbrev Number: 12 (DW_TAG_const_type)
    <21e>   DW_AT_type        : <0x217>
 <1><222>: Abbrev Number: 6 (DW_TAG_base_type)
    <223>   DW_AT_byte_size   : 1
    <224>   DW_AT_encoding    : 6	(signed char)
    <225>   DW_AT_name        : (indexed string: 0xe01): char
 <1><227>: Abbrev Number: 12 (DW_TAG_const_type)
    <228>   DW_AT_type        : <0x222>
 <1><22c>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <22d>   DW_AT_byte_size   : 8
    <22e>   DW_AT_type        : <0x97>
 <1><232>: Abbrev Number: 2 (DW_TAG_typedef)
    <233>   DW_AT_name        : (indexed string: 0x28b): lua_Writer
    <235>   DW_AT_decl_file   : 4
    <236>   DW_AT_decl_line   : 61
    <237>   DW_AT_decl_column : 15
    <238>   DW_AT_type        : <0x23c>
 <1><23c>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <23d>   DW_AT_byte_size   : 8
    <23e>   DW_AT_type        : <0x242>
 <1><242>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <243>   DW_AT_prototyped  : 1
    <243>   DW_AT_type        : <0xac>
    <247>   DW_AT_sibling     : <0x260>
 <2><24b>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <24c>   DW_AT_type        : <0x1e8>
 <2><250>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <251>   DW_AT_type        : <0x260>
 <2><255>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <256>   DW_AT_type        : <0x97>
 <2><25a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <25b>   DW_AT_type        : <0x7c>
 <2><25f>: Abbrev Number: 0
 <1><260>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <261>   DW_AT_byte_size   : 8
    <262>   DW_AT_type        : <0x266>
 <1><266>: Abbrev Number: 23 (DW_TAG_const_type)
 <1><267>: Abbrev Number: 2 (DW_TAG_typedef)
    <268>   DW_AT_name        : (indexed string: 0x110): lua_Alloc
    <26a>   DW_AT_decl_file   : 4
    <26b>   DW_AT_decl_line   : 67
    <26c>   DW_AT_decl_column : 18
    <26d>   DW_AT_type        : <0x271>
 <1><271>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <272>   DW_AT_byte_size   : 8
    <273>   DW_AT_type        : <0x277>
 <1><277>: Abbrev Number: 21 (DW_TAG_subroutine_type)
    <278>   DW_AT_prototyped  : 1
    <278>   DW_AT_type        : <0x7c>
    <27c>   DW_AT_sibling     : <0x295>
 <2><280>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <281>   DW_AT_type        : <0x7c>
 <2><285>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <286>   DW_AT_type        : <0x7c>
 <2><28a>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <28b>   DW_AT_type        : <0x97>
 <2><28f>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <290>   DW_AT_type        : <0x97>
 <2><294>: Abbrev Number: 0
 <1><295>: Abbrev Number: 2 (DW_TAG_typedef)
    <296>   DW_AT_name        : (indexed string: 0xd2c): lua_Number
    <298>   DW_AT_decl_file   : 4
    <299>   DW_AT_decl_line   : 100
    <29a>   DW_AT_decl_column : 20
    <29b>   DW_AT_type        : <0x29f>
 <1><29f>: Abbrev Number: 6 (DW_TAG_base_type)
    <2a0>   DW_AT_byte_size   : 8
    <2a1>   DW_AT_encoding    : 4	(float)
    <2a2>   DW_AT_name        : (indexed string: 0x4eb): double
 <1><2a4>: Abbrev Number: 2 (DW_TAG_typedef)
    <2a5>   DW_AT_name        : (indexed string: 0xe47): lua_Integer
    <2a7>   DW_AT_decl_file   : 4
    <2a8>   DW_AT_decl_line   : 104
    <2a9>   DW_AT_decl_column : 21
    <2aa>   DW_AT_type        : <0x88>
 <1><2ae>: Abbrev Number: 10 (DW_TAG_typedef)
    <2af>   DW_AT_name        : (indexed string: 0x120): lua_Debug
    <2b1>   DW_AT_decl_file   : 4
    <2b2>   DW_AT_decl_line   : 328
    <2b4>   DW_AT_decl_column : 26
    <2b5>   DW_AT_type        : <0x2b9>
 <1><2b9>: Abbrev Number: 17 (DW_TAG_structure_type)
    <2ba>   DW_AT_name        : (indexed string: 0x120): lua_Debug
    <2bc>   DW_AT_byte_size   : 120
    <2bd>   DW_AT_decl_file   : 4
    <2be>   DW_AT_decl_line   : 360
    <2c0>   DW_AT_decl_column : 8
    <2c1>   DW_AT_sibling     : <0x34a>
 <2><2c5>: Abbrev Number: 18 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indexed string: 0x255): event
    <2c8>   DW_AT_decl_file   : 4
    <2c9>   DW_AT_decl_line   : 361
    <2cb>   DW_AT_decl_column : 7
    <2cc>   DW_AT_type        : <0xac>
    <2d0>   DW_AT_data_member_location: 0
 <2><2d1>: Abbrev Number: 18 (DW_TAG_member)
    <2d2>   DW_AT_name        : (indexed string: 0xb9): name
    <2d4>   DW_AT_decl_file   : 4
    <2d5>   DW_AT_decl_line   : 362
    <2d7>   DW_AT_decl_column : 15
    <2d8>   DW_AT_type        : <0x217>
    <2dc>   DW_AT_data_member_location: 8
 <2><2dd>: Abbrev Number: 18 (DW_TAG_member)
    <2de>   DW_AT_name        : (indexed string: 0xb16): namewhat
    <2e0>   DW_AT_decl_file   : 4
    <2e1>   DW_AT_decl_line   : 363
    <2e3>   DW_AT_decl_column : 15
    <2e4>   DW_AT_type        : <0x217>
    <2e8>   DW_AT_data_member_location: 16
 <2><2e9>: Abbrev Number: 18 (DW_TAG_member)
    <2ea>   DW_AT_name        : (indexed string: 0x3e3): what
    <2ec>   DW_AT_decl_file   : 4
    <2ed>   DW_AT_decl_line   : 364
    <2ef>   DW_AT_decl_column : 15
    <2f0>   DW_AT_type        : <0x217>
    <2f4>   DW_AT_data_member_location: 24
 <2><2f5>: Abbrev Number: 18 (DW_TAG_member)
    <2f6>   DW_AT_name        : (indexed string: 0x9c5): source
    <2f8>   DW_AT_decl_file   : 4
    <2f9>   DW_AT_decl_line   : 365
    <2fb>   DW_AT_decl_column : 15
    <2fc>   DW_AT_type        : <0x217>
    <300>   DW_AT_data_member_location: 32
 <2><301>: Abbrev Number: 18 (DW_TAG_member)
    <302>   DW_AT_name        : (indexed string: 0x134): currentline
    <304>   DW_AT_decl_file   : 4
    <305>   DW_AT_decl_line   : 366
    <307>   DW_AT_decl_column : 7
    <308>   DW_AT_type        : <0xac>
    <30c>   DW_AT_data_member_location: 40
 <2><30d>: Abbrev Number: 18 (DW_TAG_member)
    <30e>   DW_AT_name        : (indexed string: 0x87): nups
    <310>   DW_AT_decl_file   : 4
    <311>   DW_AT_decl_line   : 367
    <313>   DW_AT_decl_column : 7
    <314>   DW_AT_type        : <0xac>
    <318>   DW_AT_data_member_location: 44
 <2><319>: Abbrev Number: 18 (DW_TAG_member)
    <31a>   DW_AT_name        : (indexed string: 0xcf6): linedefined
    <31c>   DW_AT_decl_file   : 4
    <31d>   DW_AT_decl_line   : 368
    <31f>   DW_AT_decl_column : 7
    <320>   DW_AT_type        : <0xac>
    <324>   DW_AT_data_member_location: 48
 <2><325>: Abbrev Number: 18 (DW_TAG_member)
    <326>   DW_AT_name        : (indexed string: 0xc5d): lastlinedefined
    <328>   DW_AT_decl_file   : 4
    <329>   DW_AT_decl_line   : 369
    <32b>   DW_AT_decl_column : 7
    <32c>   DW_AT_type        : <0xac>
    <330>   DW_AT_data_member_location: 52
 <2><331>: Abbrev Number: 18 (DW_TAG_member)
    <332>   DW_AT_name        : (indexed string: 0x723): short_src
    <334>   DW_AT_decl_file   : 4
    <335>   DW_AT_decl_line   : 370
    <337>   DW_AT_decl_column : 8
    <338>   DW_AT_type        : <0x371>
    <33c>   DW_AT_data_member_location: 56
 <2><33d>: Abbrev Number: 18 (DW_TAG_member)
    <33e>   DW_AT_name        : (indexed string: 0x457): i_ci
    <340>   DW_AT_decl_file   : 4
    <341>   DW_AT_decl_line   : 372
    <343>   DW_AT_decl_column : 7
    <344>   DW_AT_type        : <0xac>
    <348>   DW_AT_data_member_location: 116
 <2><349>: Abbrev Number: 0
 <1><34a>: Abbrev Number: 10 (DW_TAG_typedef)
    <34b>   DW_AT_name        : (indexed string: 0xef9): lua_Hook
    <34d>   DW_AT_decl_file   : 4
    <34e>   DW_AT_decl_line   : 332
    <350>   DW_AT_decl_column : 16
    <351>   DW_AT_type        : <0x355>
 <1><355>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <356>   DW_AT_byte_size   : 8
    <357>   DW_AT_type        : <0x35b>
 <1><35b>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <35c>   DW_AT_prototyped  : 1
    <35c>   DW_AT_sibling     : <0x36b>
 <2><360>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <361>   DW_AT_type        : <0x1e8>
 <2><365>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <366>   DW_AT_type        : <0x36b>
 <2><36a>: Abbrev Number: 0
 <1><36b>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <36c>   DW_AT_byte_size   : 8
    <36d>   DW_AT_type        : <0x2ae>
 <1><371>: Abbrev Number: 4 (DW_TAG_array_type)
    <372>   DW_AT_type        : <0x222>
    <376>   DW_AT_sibling     : <0x381>
 <2><37a>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <37b>   DW_AT_type        : <0x40>
    <37f>   DW_AT_upper_bound : 59
 <2><380>: Abbrev Number: 0
 <1><381>: Abbrev Number: 2 (DW_TAG_typedef)
    <382>   DW_AT_name        : (indexed string: 0xf27): __u_char
    <384>   DW_AT_decl_file   : 6
    <385>   DW_AT_decl_line   : 31
    <386>   DW_AT_decl_column : 23
    <387>   DW_AT_type        : <0x38b>
 <1><38b>: Abbrev Number: 6 (DW_TAG_base_type)
    <38c>   DW_AT_byte_size   : 1
    <38d>   DW_AT_encoding    : 8	(unsigned char)
    <38e>   DW_AT_name        : (indexed string: 0x7c0): unsigned char
 <1><390>: Abbrev Number: 2 (DW_TAG_typedef)
    <391>   DW_AT_name        : (indexed string: 0x813): __u_short
    <393>   DW_AT_decl_file   : 6
    <394>   DW_AT_decl_line   : 32
    <395>   DW_AT_decl_column : 28
    <396>   DW_AT_type        : <0x39a>
 <1><39a>: Abbrev Number: 6 (DW_TAG_base_type)
    <39b>   DW_AT_byte_size   : 2
    <39c>   DW_AT_encoding    : 7	(unsigned)
    <39d>   DW_AT_name        : (indexed string: 0x710): short unsigned int
 <1><39f>: Abbrev Number: 12 (DW_TAG_const_type)
    <3a0>   DW_AT_type        : <0x39a>
 <1><3a4>: Abbrev Number: 2 (DW_TAG_typedef)
    <3a5>   DW_AT_name        : (indexed string: 0x2e4): __u_int
    <3a7>   DW_AT_decl_file   : 6
    <3a8>   DW_AT_decl_line   : 33
    <3a9>   DW_AT_decl_column : 22
    <3aa>   DW_AT_type        : <0x77>
 <1><3ae>: Abbrev Number: 2 (DW_TAG_typedef)
    <3af>   DW_AT_name        : (indexed string: 0x5a6): __u_long
    <3b1>   DW_AT_decl_file   : 6
    <3b2>   DW_AT_decl_line   : 34
    <3b3>   DW_AT_decl_column : 27
    <3b4>   DW_AT_type        : <0x40>
 <1><3b8>: Abbrev Number: 2 (DW_TAG_typedef)
    <3b9>   DW_AT_name        : (indexed string: 0x667): __int8_t
    <3bb>   DW_AT_decl_file   : 6
    <3bc>   DW_AT_decl_line   : 37
    <3bd>   DW_AT_decl_column : 21
    <3be>   DW_AT_type        : <0x3c2>
 <1><3c2>: Abbrev Number: 6 (DW_TAG_base_type)
    <3c3>   DW_AT_byte_size   : 1
    <3c4>   DW_AT_encoding    : 6	(signed char)
    <3c5>   DW_AT_name        : (indexed string: 0xc98): signed char
 <1><3c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c8>   DW_AT_name        : (indexed string: 0x304): __uint8_t
    <3ca>   DW_AT_decl_file   : 6
    <3cb>   DW_AT_decl_line   : 38
    <3cc>   DW_AT_decl_column : 23
    <3cd>   DW_AT_type        : <0x38b>
 <1><3d1>: Abbrev Number: 2 (DW_TAG_typedef)
    <3d2>   DW_AT_name        : (indexed string: 0x731): __int16_t
    <3d4>   DW_AT_decl_file   : 6
    <3d5>   DW_AT_decl_line   : 39
    <3d6>   DW_AT_decl_column : 26
    <3d7>   DW_AT_type        : <0x3db>
 <1><3db>: Abbrev Number: 6 (DW_TAG_base_type)
    <3dc>   DW_AT_byte_size   : 2
    <3dd>   DW_AT_encoding    : 5	(signed)
    <3de>   DW_AT_name        : (indexed string: 0xc1): short int
 <1><3e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <3e1>   DW_AT_name        : (indexed string: 0x4e8): __uint16_t
    <3e3>   DW_AT_decl_file   : 6
    <3e4>   DW_AT_decl_line   : 40
    <3e5>   DW_AT_decl_column : 28
    <3e6>   DW_AT_type        : <0x39a>
 <1><3ea>: Abbrev Number: 2 (DW_TAG_typedef)
    <3eb>   DW_AT_name        : (indexed string: 0xb1d): __int32_t
    <3ed>   DW_AT_decl_file   : 6
    <3ee>   DW_AT_decl_line   : 41
    <3ef>   DW_AT_decl_column : 20
    <3f0>   DW_AT_type        : <0xac>
 <1><3f4>: Abbrev Number: 2 (DW_TAG_typedef)
    <3f5>   DW_AT_name        : (indexed string: 0x8b6): __uint32_t
    <3f7>   DW_AT_decl_file   : 6
    <3f8>   DW_AT_decl_line   : 42
    <3f9>   DW_AT_decl_column : 22
    <3fa>   DW_AT_type        : <0x77>
 <1><3fe>: Abbrev Number: 2 (DW_TAG_typedef)
    <3ff>   DW_AT_name        : (indexed string: 0xf2d): __int64_t
    <401>   DW_AT_decl_file   : 6
    <402>   DW_AT_decl_line   : 44
    <403>   DW_AT_decl_column : 25
    <404>   DW_AT_type        : <0x92>
 <1><408>: Abbrev Number: 2 (DW_TAG_typedef)
    <409>   DW_AT_name        : (indexed string: 0xce6): __uint64_t
    <40b>   DW_AT_decl_file   : 6
    <40c>   DW_AT_decl_line   : 45
    <40d>   DW_AT_decl_column : 27
    <40e>   DW_AT_type        : <0x40>
 <1><412>: Abbrev Number: 2 (DW_TAG_typedef)
    <413>   DW_AT_name        : (indexed string: 0xec6): __int_least8_t
    <415>   DW_AT_decl_file   : 6
    <416>   DW_AT_decl_line   : 52
    <417>   DW_AT_decl_column : 18
    <418>   DW_AT_type        : <0x3b8>
 <1><41c>: Abbrev Number: 2 (DW_TAG_typedef)
    <41d>   DW_AT_name        : (indexed string: 0x7e5): __uint_least8_t
    <41f>   DW_AT_decl_file   : 6
    <420>   DW_AT_decl_line   : 53
    <421>   DW_AT_decl_column : 19
    <422>   DW_AT_type        : <0x3c7>
 <1><426>: Abbrev Number: 2 (DW_TAG_typedef)
    <427>   DW_AT_name        : (indexed string: 0x9b2): __int_least16_t
    <429>   DW_AT_decl_file   : 6
    <42a>   DW_AT_decl_line   : 54
    <42b>   DW_AT_decl_column : 19
    <42c>   DW_AT_type        : <0x3d1>
 <1><430>: Abbrev Number: 2 (DW_TAG_typedef)
    <431>   DW_AT_name        : (indexed string: 0xde8): __uint_least16_t
    <433>   DW_AT_decl_file   : 6
    <434>   DW_AT_decl_line   : 55
    <435>   DW_AT_decl_column : 20
    <436>   DW_AT_type        : <0x3e0>
 <1><43a>: Abbrev Number: 2 (DW_TAG_typedef)
    <43b>   DW_AT_name        : (indexed string: 0xabd): __int_least32_t
    <43d>   DW_AT_decl_file   : 6
    <43e>   DW_AT_decl_line   : 56
    <43f>   DW_AT_decl_column : 19
    <440>   DW_AT_type        : <0x3ea>
 <1><444>: Abbrev Number: 2 (DW_TAG_typedef)
    <445>   DW_AT_name        : (indexed string: 0x1db): __uint_least32_t
    <447>   DW_AT_decl_file   : 6
    <448>   DW_AT_decl_line   : 57
    <449>   DW_AT_decl_column : 20
    <44a>   DW_AT_type        : <0x3f4>
 <1><44e>: Abbrev Number: 2 (DW_TAG_typedef)
    <44f>   DW_AT_name        : (indexed string: 0xa65): __int_least64_t
    <451>   DW_AT_decl_file   : 6
    <452>   DW_AT_decl_line   : 58
    <453>   DW_AT_decl_column : 19
    <454>   DW_AT_type        : <0x3fe>
 <1><458>: Abbrev Number: 2 (DW_TAG_typedef)
    <459>   DW_AT_name        : (indexed string: 0x586): __uint_least64_t
    <45b>   DW_AT_decl_file   : 6
    <45c>   DW_AT_decl_line   : 59
    <45d>   DW_AT_decl_column : 20
    <45e>   DW_AT_type        : <0x408>
 <1><462>: Abbrev Number: 2 (DW_TAG_typedef)
    <463>   DW_AT_name        : (indexed string: 0x774): __quad_t
    <465>   DW_AT_decl_file   : 6
    <466>   DW_AT_decl_line   : 63
    <467>   DW_AT_decl_column : 18
    <468>   DW_AT_type        : <0x92>
 <1><46c>: Abbrev Number: 2 (DW_TAG_typedef)
    <46d>   DW_AT_name        : (indexed string: 0xf6d): __u_quad_t
    <46f>   DW_AT_decl_file   : 6
    <470>   DW_AT_decl_line   : 64
    <471>   DW_AT_decl_column : 27
    <472>   DW_AT_type        : <0x40>
 <1><476>: Abbrev Number: 2 (DW_TAG_typedef)
    <477>   DW_AT_name        : (indexed string: 0xcd): __intmax_t
    <479>   DW_AT_decl_file   : 6
    <47a>   DW_AT_decl_line   : 72
    <47b>   DW_AT_decl_column : 18
    <47c>   DW_AT_type        : <0x92>
 <1><480>: Abbrev Number: 2 (DW_TAG_typedef)
    <481>   DW_AT_name        : (indexed string: 0x787): __uintmax_t
    <483>   DW_AT_decl_file   : 6
    <484>   DW_AT_decl_line   : 73
    <485>   DW_AT_decl_column : 27
    <486>   DW_AT_type        : <0x40>
 <1><48a>: Abbrev Number: 2 (DW_TAG_typedef)
    <48b>   DW_AT_name        : (indexed string: 0xe1f): __dev_t
    <48d>   DW_AT_decl_file   : 6
    <48e>   DW_AT_decl_line   : 145
    <48f>   DW_AT_decl_column : 25
    <490>   DW_AT_type        : <0x40>
 <1><494>: Abbrev Number: 2 (DW_TAG_typedef)
    <495>   DW_AT_name        : (indexed string: 0x807): __uid_t
    <497>   DW_AT_decl_file   : 6
    <498>   DW_AT_decl_line   : 146
    <499>   DW_AT_decl_column : 25
    <49a>   DW_AT_type        : <0x77>
 <1><49e>: Abbrev Number: 2 (DW_TAG_typedef)
    <49f>   DW_AT_name        : (indexed string: 0x5a1): __gid_t
    <4a1>   DW_AT_decl_file   : 6
    <4a2>   DW_AT_decl_line   : 147
    <4a3>   DW_AT_decl_column : 25
    <4a4>   DW_AT_type        : <0x77>
 <1><4a8>: Abbrev Number: 2 (DW_TAG_typedef)
    <4a9>   DW_AT_name        : (indexed string: 0x48d): __ino_t
    <4ab>   DW_AT_decl_file   : 6
    <4ac>   DW_AT_decl_line   : 148
    <4ad>   DW_AT_decl_column : 25
    <4ae>   DW_AT_type        : <0x40>
 <1><4b2>: Abbrev Number: 2 (DW_TAG_typedef)
    <4b3>   DW_AT_name        : (indexed string: 0x2cf): __ino64_t
    <4b5>   DW_AT_decl_file   : 6
    <4b6>   DW_AT_decl_line   : 149
    <4b7>   DW_AT_decl_column : 27
    <4b8>   DW_AT_type        : <0x40>
 <1><4bc>: Abbrev Number: 2 (DW_TAG_typedef)
    <4bd>   DW_AT_name        : (indexed string: 0xf78): __mode_t
    <4bf>   DW_AT_decl_file   : 6
    <4c0>   DW_AT_decl_line   : 150
    <4c1>   DW_AT_decl_column : 26
    <4c2>   DW_AT_type        : <0x77>
 <1><4c6>: Abbrev Number: 2 (DW_TAG_typedef)
    <4c7>   DW_AT_name        : (indexed string: 0x94e): __nlink_t
    <4c9>   DW_AT_decl_file   : 6
    <4ca>   DW_AT_decl_line   : 151
    <4cb>   DW_AT_decl_column : 27
    <4cc>   DW_AT_type        : <0x40>
 <1><4d0>: Abbrev Number: 2 (DW_TAG_typedef)
    <4d1>   DW_AT_name        : (indexed string: 0x840): __off_t
    <4d3>   DW_AT_decl_file   : 6
    <4d4>   DW_AT_decl_line   : 152
    <4d5>   DW_AT_decl_column : 25
    <4d6>   DW_AT_type        : <0x92>
 <1><4da>: Abbrev Number: 2 (DW_TAG_typedef)
    <4db>   DW_AT_name        : (indexed string: 0xc7f): __off64_t
    <4dd>   DW_AT_decl_file   : 6
    <4de>   DW_AT_decl_line   : 153
    <4df>   DW_AT_decl_column : 27
    <4e0>   DW_AT_type        : <0x92>
 <1><4e4>: Abbrev Number: 2 (DW_TAG_typedef)
    <4e5>   DW_AT_name        : (indexed string: 0xbd0): __pid_t
    <4e7>   DW_AT_decl_file   : 6
    <4e8>   DW_AT_decl_line   : 154
    <4e9>   DW_AT_decl_column : 25
    <4ea>   DW_AT_type        : <0xac>
 <1><4ee>: Abbrev Number: 25 (DW_TAG_structure_type)
    <4ef>   DW_AT_byte_size   : 8
    <4f0>   DW_AT_decl_file   : 6
    <4f1>   DW_AT_decl_line   : 155
    <4f2>   DW_AT_decl_column : 12
    <4f3>   DW_AT_sibling     : <0x503>
 <2><4f7>: Abbrev Number: 26 (DW_TAG_member)
    <4f8>   DW_AT_name        : (indexed string: 0xe77): __val
    <4fa>   DW_AT_decl_file   : 6
    <4fb>   DW_AT_decl_line   : 155
    <4fc>   DW_AT_decl_column : 12
    <4fd>   DW_AT_type        : <0x503>
    <501>   DW_AT_data_member_location: 0
 <2><502>: Abbrev Number: 0
 <1><503>: Abbrev Number: 4 (DW_TAG_array_type)
    <504>   DW_AT_type        : <0xac>
    <508>   DW_AT_sibling     : <0x513>
 <2><50c>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <50d>   DW_AT_type        : <0x40>
    <511>   DW_AT_upper_bound : 1
 <2><512>: Abbrev Number: 0
 <1><513>: Abbrev Number: 2 (DW_TAG_typedef)
    <514>   DW_AT_name        : (indexed string: 0x70d): __fsid_t
    <516>   DW_AT_decl_file   : 6
    <517>   DW_AT_decl_line   : 155
    <518>   DW_AT_decl_column : 26
    <519>   DW_AT_type        : <0x4ee>
 <1><51d>: Abbrev Number: 2 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indexed string: 0x8a9): __clock_t
    <520>   DW_AT_decl_file   : 6
    <521>   DW_AT_decl_line   : 156
    <522>   DW_AT_decl_column : 27
    <523>   DW_AT_type        : <0x92>
 <1><527>: Abbrev Number: 2 (DW_TAG_typedef)
    <528>   DW_AT_name        : (indexed string: 0xae): __rlim_t
    <52a>   DW_AT_decl_file   : 6
    <52b>   DW_AT_decl_line   : 157
    <52c>   DW_AT_decl_column : 26
    <52d>   DW_AT_type        : <0x40>
 <1><531>: Abbrev Number: 2 (DW_TAG_typedef)
    <532>   DW_AT_name        : (indexed string: 0x171): __rlim64_t
    <534>   DW_AT_decl_file   : 6
    <535>   DW_AT_decl_line   : 158
    <536>   DW_AT_decl_column : 28
    <537>   DW_AT_type        : <0x40>
 <1><53b>: Abbrev Number: 2 (DW_TAG_typedef)
    <53c>   DW_AT_name        : (indexed string: 0xc7): __id_t
    <53e>   DW_AT_decl_file   : 6
    <53f>   DW_AT_decl_line   : 159
    <540>   DW_AT_decl_column : 24
    <541>   DW_AT_type        : <0x77>
 <1><545>: Abbrev Number: 2 (DW_TAG_typedef)
    <546>   DW_AT_name        : (indexed string: 0x959): __time_t
    <548>   DW_AT_decl_file   : 6
    <549>   DW_AT_decl_line   : 160
    <54a>   DW_AT_decl_column : 26
    <54b>   DW_AT_type        : <0x92>
 <1><54f>: Abbrev Number: 2 (DW_TAG_typedef)
    <550>   DW_AT_name        : (indexed string: 0x276): __useconds_t
    <552>   DW_AT_decl_file   : 6
    <553>   DW_AT_decl_line   : 161
    <554>   DW_AT_decl_column : 30
    <555>   DW_AT_type        : <0x77>
 <1><559>: Abbrev Number: 2 (DW_TAG_typedef)
    <55a>   DW_AT_name        : (indexed string: 0x7e6): __suseconds_t
    <55c>   DW_AT_decl_file   : 6
    <55d>   DW_AT_decl_line   : 162
    <55e>   DW_AT_decl_column : 31
    <55f>   DW_AT_type        : <0x92>
 <1><563>: Abbrev Number: 2 (DW_TAG_typedef)
    <564>   DW_AT_name        : (indexed string: 0xe65): __daddr_t
    <566>   DW_AT_decl_file   : 6
    <567>   DW_AT_decl_line   : 164
    <568>   DW_AT_decl_column : 27
    <569>   DW_AT_type        : <0xac>
 <1><56d>: Abbrev Number: 2 (DW_TAG_typedef)
    <56e>   DW_AT_name        : (indexed string: 0x980): __key_t
    <570>   DW_AT_decl_file   : 6
    <571>   DW_AT_decl_line   : 165
    <572>   DW_AT_decl_column : 25
    <573>   DW_AT_type        : <0xac>
 <1><577>: Abbrev Number: 2 (DW_TAG_typedef)
    <578>   DW_AT_name        : (indexed string: 0xe6): __clockid_t
    <57a>   DW_AT_decl_file   : 6
    <57b>   DW_AT_decl_line   : 168
    <57c>   DW_AT_decl_column : 29
    <57d>   DW_AT_type        : <0xac>
 <1><581>: Abbrev Number: 2 (DW_TAG_typedef)
    <582>   DW_AT_name        : (indexed string: 0x20f): __timer_t
    <584>   DW_AT_decl_file   : 6
    <585>   DW_AT_decl_line   : 171
    <586>   DW_AT_decl_column : 27
    <587>   DW_AT_type        : <0x7c>
 <1><58b>: Abbrev Number: 2 (DW_TAG_typedef)
    <58c>   DW_AT_name        : (indexed string: 0xfda): __blksize_t
    <58e>   DW_AT_decl_file   : 6
    <58f>   DW_AT_decl_line   : 174
    <590>   DW_AT_decl_column : 29
    <591>   DW_AT_type        : <0x92>
 <1><595>: Abbrev Number: 2 (DW_TAG_typedef)
    <596>   DW_AT_name        : (indexed string: 0x19a): __blkcnt_t
    <598>   DW_AT_decl_file   : 6
    <599>   DW_AT_decl_line   : 179
    <59a>   DW_AT_decl_column : 28
    <59b>   DW_AT_type        : <0x92>
 <1><59f>: Abbrev Number: 2 (DW_TAG_typedef)
    <5a0>   DW_AT_name        : (indexed string: 0x246): __blkcnt64_t
    <5a2>   DW_AT_decl_file   : 6
    <5a3>   DW_AT_decl_line   : 180
    <5a4>   DW_AT_decl_column : 30
    <5a5>   DW_AT_type        : <0x92>
 <1><5a9>: Abbrev Number: 2 (DW_TAG_typedef)
    <5aa>   DW_AT_name        : (indexed string: 0xabc): __fsblkcnt_t
    <5ac>   DW_AT_decl_file   : 6
    <5ad>   DW_AT_decl_line   : 183
    <5ae>   DW_AT_decl_column : 30
    <5af>   DW_AT_type        : <0x40>
 <1><5b3>: Abbrev Number: 2 (DW_TAG_typedef)
    <5b4>   DW_AT_name        : (indexed string: 0xfd7): __fsblkcnt64_t
    <5b6>   DW_AT_decl_file   : 6
    <5b7>   DW_AT_decl_line   : 184
    <5b8>   DW_AT_decl_column : 32
    <5b9>   DW_AT_type        : <0x40>
 <1><5bd>: Abbrev Number: 2 (DW_TAG_typedef)
    <5be>   DW_AT_name        : (indexed string: 0x56a): __fsfilcnt_t
    <5c0>   DW_AT_decl_file   : 6
    <5c1>   DW_AT_decl_line   : 187
    <5c2>   DW_AT_decl_column : 30
    <5c3>   DW_AT_type        : <0x40>
 <1><5c7>: Abbrev Number: 2 (DW_TAG_typedef)
    <5c8>   DW_AT_name        : (indexed string: 0x4ab): __fsfilcnt64_t
    <5ca>   DW_AT_decl_file   : 6
    <5cb>   DW_AT_decl_line   : 188
    <5cc>   DW_AT_decl_column : 32
    <5cd>   DW_AT_type        : <0x40>
 <1><5d1>: Abbrev Number: 2 (DW_TAG_typedef)
    <5d2>   DW_AT_name        : (indexed string: 0x104): __fsword_t
    <5d4>   DW_AT_decl_file   : 6
    <5d5>   DW_AT_decl_line   : 191
    <5d6>   DW_AT_decl_column : 28
    <5d7>   DW_AT_type        : <0x92>
 <1><5db>: Abbrev Number: 2 (DW_TAG_typedef)
    <5dc>   DW_AT_name        : (indexed string: 0xaff): __ssize_t
    <5de>   DW_AT_decl_file   : 6
    <5df>   DW_AT_decl_line   : 193
    <5e0>   DW_AT_decl_column : 27
    <5e1>   DW_AT_type        : <0x92>
 <1><5e5>: Abbrev Number: 2 (DW_TAG_typedef)
    <5e6>   DW_AT_name        : (indexed string: 0xed9): __syscall_slong_t
    <5e8>   DW_AT_decl_file   : 6
    <5e9>   DW_AT_decl_line   : 196
    <5ea>   DW_AT_decl_column : 33
    <5eb>   DW_AT_type        : <0x92>
 <1><5ef>: Abbrev Number: 2 (DW_TAG_typedef)
    <5f0>   DW_AT_name        : (indexed string: 0xc1b): __syscall_ulong_t
    <5f2>   DW_AT_decl_file   : 6
    <5f3>   DW_AT_decl_line   : 198
    <5f4>   DW_AT_decl_column : 33
    <5f5>   DW_AT_type        : <0x40>
 <1><5f9>: Abbrev Number: 2 (DW_TAG_typedef)
    <5fa>   DW_AT_name        : (indexed string: 0xa13): __loff_t
    <5fc>   DW_AT_decl_file   : 6
    <5fd>   DW_AT_decl_line   : 202
    <5fe>   DW_AT_decl_column : 19
    <5ff>   DW_AT_type        : <0x4da>
 <1><603>: Abbrev Number: 2 (DW_TAG_typedef)
    <604>   DW_AT_name        : (indexed string: 0xfbb): __caddr_t
    <606>   DW_AT_decl_file   : 6
    <607>   DW_AT_decl_line   : 203
    <608>   DW_AT_decl_column : 15
    <609>   DW_AT_type        : <0x60d>
 <1><60d>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <60e>   DW_AT_byte_size   : 8
    <60f>   DW_AT_type        : <0x222>
 <1><613>: Abbrev Number: 2 (DW_TAG_typedef)
    <614>   DW_AT_name        : (indexed string: 0xe02): __intptr_t
    <616>   DW_AT_decl_file   : 6
    <617>   DW_AT_decl_line   : 206
    <618>   DW_AT_decl_column : 25
    <619>   DW_AT_type        : <0x92>
 <1><61d>: Abbrev Number: 2 (DW_TAG_typedef)
    <61e>   DW_AT_name        : (indexed string: 0x54e): __socklen_t
    <620>   DW_AT_decl_file   : 6
    <621>   DW_AT_decl_line   : 209
    <622>   DW_AT_decl_column : 23
    <623>   DW_AT_type        : <0x77>
 <1><627>: Abbrev Number: 2 (DW_TAG_typedef)
    <628>   DW_AT_name        : (indexed string: 0x937): __sig_atomic_t
    <62a>   DW_AT_decl_file   : 6
    <62b>   DW_AT_decl_line   : 214
    <62c>   DW_AT_decl_column : 13
    <62d>   DW_AT_type        : <0xac>
 <1><631>: Abbrev Number: 2 (DW_TAG_typedef)
    <632>   DW_AT_name        : (indexed string: 0xcf0): int8_t
    <634>   DW_AT_decl_file   : 7
    <635>   DW_AT_decl_line   : 24
    <636>   DW_AT_decl_column : 18
    <637>   DW_AT_type        : <0x3b8>
 <1><63b>: Abbrev Number: 2 (DW_TAG_typedef)
    <63c>   DW_AT_name        : (indexed string: 0xd6): int16_t
    <63e>   DW_AT_decl_file   : 7
    <63f>   DW_AT_decl_line   : 25
    <640>   DW_AT_decl_column : 19
    <641>   DW_AT_type        : <0x3d1>
 <1><645>: Abbrev Number: 2 (DW_TAG_typedef)
    <646>   DW_AT_name        : (indexed string: 0xf8e): int32_t
    <648>   DW_AT_decl_file   : 7
    <649>   DW_AT_decl_line   : 26
    <64a>   DW_AT_decl_column : 19
    <64b>   DW_AT_type        : <0x3ea>
 <1><64f>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <650>   DW_AT_type        : <0x645>
 <1><654>: Abbrev Number: 2 (DW_TAG_typedef)
    <655>   DW_AT_name        : (indexed string: 0x396): int64_t
    <657>   DW_AT_decl_file   : 7
    <658>   DW_AT_decl_line   : 27
    <659>   DW_AT_decl_column : 19
    <65a>   DW_AT_type        : <0x3fe>
 <1><65e>: Abbrev Number: 2 (DW_TAG_typedef)
    <65f>   DW_AT_name        : (indexed string: 0x77a): uint8_t
    <661>   DW_AT_decl_file   : 8
    <662>   DW_AT_decl_line   : 24
    <663>   DW_AT_decl_column : 19
    <664>   DW_AT_type        : <0x3c7>
 <1><668>: Abbrev Number: 12 (DW_TAG_const_type)
    <669>   DW_AT_type        : <0x65e>
 <1><66d>: Abbrev Number: 2 (DW_TAG_typedef)
    <66e>   DW_AT_name        : (indexed string: 0xd64): uint16_t
    <670>   DW_AT_decl_file   : 8
    <671>   DW_AT_decl_line   : 25
    <672>   DW_AT_decl_column : 20
    <673>   DW_AT_type        : <0x3e0>
 <1><677>: Abbrev Number: 12 (DW_TAG_const_type)
    <678>   DW_AT_type        : <0x66d>
 <1><67c>: Abbrev Number: 2 (DW_TAG_typedef)
    <67d>   DW_AT_name        : (indexed string: 0x119): uint32_t
    <67f>   DW_AT_decl_file   : 8
    <680>   DW_AT_decl_line   : 26
    <681>   DW_AT_decl_column : 20
    <682>   DW_AT_type        : <0x3f4>
 <1><686>: Abbrev Number: 2 (DW_TAG_typedef)
    <687>   DW_AT_name        : (indexed string: 0x515): uint64_t
    <689>   DW_AT_decl_file   : 8
    <68a>   DW_AT_decl_line   : 27
    <68b>   DW_AT_decl_column : 20
    <68c>   DW_AT_type        : <0x408>
 <1><690>: Abbrev Number: 2 (DW_TAG_typedef)
    <691>   DW_AT_name        : (indexed string: 0x6d8): int_least8_t
    <693>   DW_AT_decl_file   : 9
    <694>   DW_AT_decl_line   : 43
    <695>   DW_AT_decl_column : 24
    <696>   DW_AT_type        : <0x412>
 <1><69a>: Abbrev Number: 2 (DW_TAG_typedef)
    <69b>   DW_AT_name        : (indexed string: 0x718): int_least16_t
    <69d>   DW_AT_decl_file   : 9
    <69e>   DW_AT_decl_line   : 44
    <69f>   DW_AT_decl_column : 25
    <6a0>   DW_AT_type        : <0x426>
 <1><6a4>: Abbrev Number: 2 (DW_TAG_typedef)
    <6a5>   DW_AT_name        : (indexed string: 0xb00): int_least32_t
    <6a7>   DW_AT_decl_file   : 9
    <6a8>   DW_AT_decl_line   : 45
    <6a9>   DW_AT_decl_column : 25
    <6aa>   DW_AT_type        : <0x43a>
 <1><6ae>: Abbrev Number: 2 (DW_TAG_typedef)
    <6af>   DW_AT_name        : (indexed string: 0xf0c): int_least64_t
    <6b1>   DW_AT_decl_file   : 9
    <6b2>   DW_AT_decl_line   : 46
    <6b3>   DW_AT_decl_column : 25
    <6b4>   DW_AT_type        : <0x44e>
 <1><6b8>: Abbrev Number: 2 (DW_TAG_typedef)
    <6b9>   DW_AT_name        : (indexed string: 0x186): uint_least8_t
    <6bb>   DW_AT_decl_file   : 9
    <6bc>   DW_AT_decl_line   : 49
    <6bd>   DW_AT_decl_column : 25
    <6be>   DW_AT_type        : <0x41c>
 <1><6c2>: Abbrev Number: 2 (DW_TAG_typedef)
    <6c3>   DW_AT_name        : (indexed string: 0xe7b): uint_least16_t
    <6c5>   DW_AT_decl_file   : 9
    <6c6>   DW_AT_decl_line   : 50
    <6c7>   DW_AT_decl_column : 26
    <6c8>   DW_AT_type        : <0x430>
 <1><6cc>: Abbrev Number: 2 (DW_TAG_typedef)
    <6cd>   DW_AT_name        : (indexed string: 0x101): uint_least32_t
    <6cf>   DW_AT_decl_file   : 9
    <6d0>   DW_AT_decl_line   : 51
    <6d1>   DW_AT_decl_column : 26
    <6d2>   DW_AT_type        : <0x444>
 <1><6d6>: Abbrev Number: 2 (DW_TAG_typedef)
    <6d7>   DW_AT_name        : (indexed string: 0x669): uint_least64_t
    <6d9>   DW_AT_decl_file   : 9
    <6da>   DW_AT_decl_line   : 52
    <6db>   DW_AT_decl_column : 26
    <6dc>   DW_AT_type        : <0x458>
 <1><6e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <6e1>   DW_AT_name        : (indexed string: 0xf9c): int_fast8_t
    <6e3>   DW_AT_decl_file   : 9
    <6e4>   DW_AT_decl_line   : 58
    <6e5>   DW_AT_decl_column : 22
    <6e6>   DW_AT_type        : <0x3c2>
 <1><6ea>: Abbrev Number: 2 (DW_TAG_typedef)
    <6eb>   DW_AT_name        : (indexed string: 0xa4c): int_fast16_t
    <6ed>   DW_AT_decl_file   : 9
    <6ee>   DW_AT_decl_line   : 60
    <6ef>   DW_AT_decl_column : 19
    <6f0>   DW_AT_type        : <0x92>
 <1><6f4>: Abbrev Number: 2 (DW_TAG_typedef)
    <6f5>   DW_AT_name        : (indexed string: 0xe5b): int_fast32_t
    <6f7>   DW_AT_decl_file   : 9
    <6f8>   DW_AT_decl_line   : 61
    <6f9>   DW_AT_decl_column : 19
    <6fa>   DW_AT_type        : <0x92>
 <1><6fe>: Abbrev Number: 2 (DW_TAG_typedef)
    <6ff>   DW_AT_name        : (indexed string: 0x55b): int_fast64_t
    <701>   DW_AT_decl_file   : 9
    <702>   DW_AT_decl_line   : 62
    <703>   DW_AT_decl_column : 19
    <704>   DW_AT_type        : <0x92>
 <1><708>: Abbrev Number: 2 (DW_TAG_typedef)
    <709>   DW_AT_name        : (indexed string: 0x6ca): uint_fast8_t
    <70b>   DW_AT_decl_file   : 9
    <70c>   DW_AT_decl_line   : 71
    <70d>   DW_AT_decl_column : 24
    <70e>   DW_AT_type        : <0x38b>
 <1><712>: Abbrev Number: 2 (DW_TAG_typedef)
    <713>   DW_AT_name        : (indexed string: 0x96b): uint_fast16_t
    <715>   DW_AT_decl_file   : 9
    <716>   DW_AT_decl_line   : 73
    <717>   DW_AT_decl_column : 27
    <718>   DW_AT_type        : <0x40>
 <1><71c>: Abbrev Number: 2 (DW_TAG_typedef)
    <71d>   DW_AT_name        : (indexed string: 0x6f5): uint_fast32_t
    <71f>   DW_AT_decl_file   : 9
    <720>   DW_AT_decl_line   : 74
    <721>   DW_AT_decl_column : 27
    <722>   DW_AT_type        : <0x40>
 <1><726>: Abbrev Number: 2 (DW_TAG_typedef)
    <727>   DW_AT_name        : (indexed string: 0xaf9): uint_fast64_t
    <729>   DW_AT_decl_file   : 9
    <72a>   DW_AT_decl_line   : 75
    <72b>   DW_AT_decl_column : 27
    <72c>   DW_AT_type        : <0x40>
 <1><730>: Abbrev Number: 2 (DW_TAG_typedef)
    <731>   DW_AT_name        : (indexed string: 0x661): intptr_t
    <733>   DW_AT_decl_file   : 9
    <734>   DW_AT_decl_line   : 87
    <735>   DW_AT_decl_column : 19
    <736>   DW_AT_type        : <0x92>
 <1><73a>: Abbrev Number: 2 (DW_TAG_typedef)
    <73b>   DW_AT_name        : (indexed string: 0xbd1): uintptr_t
    <73d>   DW_AT_decl_file   : 9
    <73e>   DW_AT_decl_line   : 90
    <73f>   DW_AT_decl_column : 27
    <740>   DW_AT_type        : <0x40>
 <1><744>: Abbrev Number: 2 (DW_TAG_typedef)
    <745>   DW_AT_name        : (indexed string: 0x8f3): intmax_t
    <747>   DW_AT_decl_file   : 9
    <748>   DW_AT_decl_line   : 101
    <749>   DW_AT_decl_column : 21
    <74a>   DW_AT_type        : <0x476>
 <1><74e>: Abbrev Number: 2 (DW_TAG_typedef)
    <74f>   DW_AT_name        : (indexed string: 0x31f): uintmax_t
    <751>   DW_AT_decl_file   : 9
    <752>   DW_AT_decl_line   : 102
    <753>   DW_AT_decl_column : 22
    <754>   DW_AT_type        : <0x480>
 <1><758>: Abbrev Number: 27 (DW_TAG_structure_type)
    <759>   DW_AT_name        : (indexed string: 0x351): __locale_struct
    <75b>   DW_AT_byte_size   : 232
    <75c>   DW_AT_decl_file   : 10
    <75d>   DW_AT_decl_line   : 28
    <75e>   DW_AT_decl_column : 8
    <75f>   DW_AT_sibling     : <0x79b>
 <2><763>: Abbrev Number: 26 (DW_TAG_member)
    <764>   DW_AT_name        : (indexed string: 0x96): __locales
    <766>   DW_AT_decl_file   : 10
    <767>   DW_AT_decl_line   : 31
    <768>   DW_AT_decl_column : 25
    <769>   DW_AT_type        : <0x79b>
    <76d>   DW_AT_data_member_location: 0
 <2><76e>: Abbrev Number: 26 (DW_TAG_member)
    <76f>   DW_AT_name        : (indexed string: 0xa30): __ctype_b
    <771>   DW_AT_decl_file   : 10
    <772>   DW_AT_decl_line   : 34
    <773>   DW_AT_decl_column : 29
    <774>   DW_AT_type        : <0x7b4>
    <778>   DW_AT_data_member_location: 104
 <2><779>: Abbrev Number: 26 (DW_TAG_member)
    <77a>   DW_AT_name        : (indexed string: 0xf2e): __ctype_tolower
    <77c>   DW_AT_decl_file   : 10
    <77d>   DW_AT_decl_line   : 35
    <77e>   DW_AT_decl_column : 14
    <77f>   DW_AT_type        : <0x7ba>
    <783>   DW_AT_data_member_location: 112
 <2><784>: Abbrev Number: 26 (DW_TAG_member)
    <785>   DW_AT_name        : (indexed string: 0x9f6): __ctype_toupper
    <787>   DW_AT_decl_file   : 10
    <788>   DW_AT_decl_line   : 36
    <789>   DW_AT_decl_column : 14
    <78a>   DW_AT_type        : <0x7ba>
    <78e>   DW_AT_data_member_location: 120
 <2><78f>: Abbrev Number: 26 (DW_TAG_member)
    <790>   DW_AT_name        : (indexed string: 0xa8b): __names
    <792>   DW_AT_decl_file   : 10
    <793>   DW_AT_decl_line   : 39
    <794>   DW_AT_decl_column : 15
    <795>   DW_AT_type        : <0x7c0>
    <799>   DW_AT_data_member_location: 128
 <2><79a>: Abbrev Number: 0
 <1><79b>: Abbrev Number: 4 (DW_TAG_array_type)
    <79c>   DW_AT_type        : <0x7ab>
    <7a0>   DW_AT_sibling     : <0x7ab>
 <2><7a4>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <7a5>   DW_AT_type        : <0x40>
    <7a9>   DW_AT_upper_bound : 12
 <2><7aa>: Abbrev Number: 0
 <1><7ab>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <7ac>   DW_AT_byte_size   : 8
    <7ad>   DW_AT_type        : <0x7b1>
 <1><7b1>: Abbrev Number: 28 (DW_TAG_structure_type)
    <7b2>   DW_AT_name        : (indexed string: 0x1bf): __locale_data
    <7b4>   DW_AT_declaration : 1
 <1><7b4>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <7b5>   DW_AT_byte_size   : 8
    <7b6>   DW_AT_type        : <0x39f>
 <1><7ba>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <7bb>   DW_AT_byte_size   : 8
    <7bc>   DW_AT_type        : <0xb3>
 <1><7c0>: Abbrev Number: 4 (DW_TAG_array_type)
    <7c1>   DW_AT_type        : <0x217>
    <7c5>   DW_AT_sibling     : <0x7d0>
 <2><7c9>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <7ca>   DW_AT_type        : <0x40>
    <7ce>   DW_AT_upper_bound : 12
 <2><7cf>: Abbrev Number: 0
 <1><7d0>: Abbrev Number: 2 (DW_TAG_typedef)
    <7d1>   DW_AT_name        : (indexed string: 0x202): __locale_t
    <7d3>   DW_AT_decl_file   : 10
    <7d4>   DW_AT_decl_line   : 42
    <7d5>   DW_AT_decl_column : 33
    <7d6>   DW_AT_type        : <0x7da>
 <1><7da>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <7db>   DW_AT_byte_size   : 8
    <7dc>   DW_AT_type        : <0x758>
 <1><7e0>: Abbrev Number: 2 (DW_TAG_typedef)
    <7e1>   DW_AT_name        : (indexed string: 0xa39): locale_t
    <7e3>   DW_AT_decl_file   : 11
    <7e4>   DW_AT_decl_line   : 24
    <7e5>   DW_AT_decl_column : 20
    <7e6>   DW_AT_type        : <0x7d0>
 <1><7ea>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <7eb>   DW_AT_encoding    : 7	(unsigned)
    <7ec>   DW_AT_byte_size   : 4
    <7ed>   DW_AT_type        : <0x77>
    <7f1>   DW_AT_decl_file   : 12
    <7f2>   DW_AT_decl_line   : 53
    <7f3>   DW_AT_decl_column : 1
    <7f4>   DW_AT_sibling     : <0x805>
 <2><7f8>: Abbrev Number: 30 (DW_TAG_enumerator)
    <7f9>   DW_AT_name        : (indexed string: 0x5e4): P_ALL
    <7fb>   DW_AT_const_value : 0
 <2><7fc>: Abbrev Number: 30 (DW_TAG_enumerator)
    <7fd>   DW_AT_name        : (indexed string: 0x8e5): P_PID
    <7ff>   DW_AT_const_value : 1
 <2><800>: Abbrev Number: 30 (DW_TAG_enumerator)
    <801>   DW_AT_name        : (indexed string: 0xdba): P_PGID
    <803>   DW_AT_const_value : 2
 <2><804>: Abbrev Number: 0
 <1><805>: Abbrev Number: 2 (DW_TAG_typedef)
    <806>   DW_AT_name        : (indexed string: 0x9fe): idtype_t
    <808>   DW_AT_decl_file   : 12
    <809>   DW_AT_decl_line   : 57
    <80a>   DW_AT_decl_column : 3
    <80b>   DW_AT_type        : <0x7ea>
 <1><80f>: Abbrev Number: 25 (DW_TAG_structure_type)
    <810>   DW_AT_byte_size   : 8
    <811>   DW_AT_decl_file   : 13
    <812>   DW_AT_decl_line   : 58
    <813>   DW_AT_decl_column : 9
    <814>   DW_AT_sibling     : <0x831>
 <2><818>: Abbrev Number: 26 (DW_TAG_member)
    <819>   DW_AT_name        : (indexed string: 0x2ad): quot
    <81b>   DW_AT_decl_file   : 13
    <81c>   DW_AT_decl_line   : 60
    <81d>   DW_AT_decl_column : 9
    <81e>   DW_AT_type        : <0xac>
    <822>   DW_AT_data_member_location: 0
 <2><823>: Abbrev Number: 31 (DW_TAG_member)
    <824>   DW_AT_name        : rem
    <828>   DW_AT_decl_file   : 13
    <829>   DW_AT_decl_line   : 61
    <82a>   DW_AT_decl_column : 9
    <82b>   DW_AT_type        : <0xac>
    <82f>   DW_AT_data_member_location: 4
 <2><830>: Abbrev Number: 0
 <1><831>: Abbrev Number: 2 (DW_TAG_typedef)
    <832>   DW_AT_name        : (indexed string: 0xd81): div_t
    <834>   DW_AT_decl_file   : 13
    <835>   DW_AT_decl_line   : 62
    <836>   DW_AT_decl_column : 5
    <837>   DW_AT_type        : <0x80f>
 <1><83b>: Abbrev Number: 25 (DW_TAG_structure_type)
    <83c>   DW_AT_byte_size   : 16
    <83d>   DW_AT_decl_file   : 13
    <83e>   DW_AT_decl_line   : 66
    <83f>   DW_AT_decl_column : 9
    <840>   DW_AT_sibling     : <0x85d>
 <2><844>: Abbrev Number: 26 (DW_TAG_member)
    <845>   DW_AT_name        : (indexed string: 0x2ad): quot
    <847>   DW_AT_decl_file   : 13
    <848>   DW_AT_decl_line   : 68
    <849>   DW_AT_decl_column : 14
    <84a>   DW_AT_type        : <0x92>
    <84e>   DW_AT_data_member_location: 0
 <2><84f>: Abbrev Number: 31 (DW_TAG_member)
    <850>   DW_AT_name        : rem
    <854>   DW_AT_decl_file   : 13
    <855>   DW_AT_decl_line   : 69
    <856>   DW_AT_decl_column : 14
    <857>   DW_AT_type        : <0x92>
    <85b>   DW_AT_data_member_location: 8
 <2><85c>: Abbrev Number: 0
 <1><85d>: Abbrev Number: 2 (DW_TAG_typedef)
    <85e>   DW_AT_name        : (indexed string: 0x474): ldiv_t
    <860>   DW_AT_decl_file   : 13
    <861>   DW_AT_decl_line   : 70
    <862>   DW_AT_decl_column : 5
    <863>   DW_AT_type        : <0x83b>
 <1><867>: Abbrev Number: 25 (DW_TAG_structure_type)
    <868>   DW_AT_byte_size   : 16
    <869>   DW_AT_decl_file   : 13
    <86a>   DW_AT_decl_line   : 76
    <86b>   DW_AT_decl_column : 23
    <86c>   DW_AT_sibling     : <0x889>
 <2><870>: Abbrev Number: 26 (DW_TAG_member)
    <871>   DW_AT_name        : (indexed string: 0x2ad): quot
    <873>   DW_AT_decl_file   : 13
    <874>   DW_AT_decl_line   : 78
    <875>   DW_AT_decl_column : 19
    <876>   DW_AT_type        : <0xe3>
    <87a>   DW_AT_data_member_location: 0
 <2><87b>: Abbrev Number: 31 (DW_TAG_member)
    <87c>   DW_AT_name        : rem
    <880>   DW_AT_decl_file   : 13
    <881>   DW_AT_decl_line   : 79
    <882>   DW_AT_decl_column : 19
    <883>   DW_AT_type        : <0xe3>
    <887>   DW_AT_data_member_location: 8
 <2><888>: Abbrev Number: 0
 <1><889>: Abbrev Number: 2 (DW_TAG_typedef)
    <88a>   DW_AT_name        : (indexed string: 0x4de): lldiv_t
    <88c>   DW_AT_decl_file   : 13
    <88d>   DW_AT_decl_line   : 80
    <88e>   DW_AT_decl_column : 5
    <88f>   DW_AT_type        : <0x867>
 <1><893>: Abbrev Number: 2 (DW_TAG_typedef)
    <894>   DW_AT_name        : (indexed string: 0x58c): u_char
    <896>   DW_AT_decl_file   : 14
    <897>   DW_AT_decl_line   : 33
    <898>   DW_AT_decl_column : 18
    <899>   DW_AT_type        : <0x381>
 <1><89d>: Abbrev Number: 2 (DW_TAG_typedef)
    <89e>   DW_AT_name        : (indexed string: 0xca3): u_short
    <8a0>   DW_AT_decl_file   : 14
    <8a1>   DW_AT_decl_line   : 34
    <8a2>   DW_AT_decl_column : 19
    <8a3>   DW_AT_type        : <0x390>
 <1><8a7>: Abbrev Number: 2 (DW_TAG_typedef)
    <8a8>   DW_AT_name        : (indexed string: 0x43a): u_int
    <8aa>   DW_AT_decl_file   : 14
    <8ab>   DW_AT_decl_line   : 35
    <8ac>   DW_AT_decl_column : 17
    <8ad>   DW_AT_type        : <0x3a4>
 <1><8b1>: Abbrev Number: 2 (DW_TAG_typedef)
    <8b2>   DW_AT_name        : (indexed string: 0xc19): u_long
    <8b4>   DW_AT_decl_file   : 14
    <8b5>   DW_AT_decl_line   : 36
    <8b6>   DW_AT_decl_column : 18
    <8b7>   DW_AT_type        : <0x3ae>
 <1><8bb>: Abbrev Number: 2 (DW_TAG_typedef)
    <8bc>   DW_AT_name        : (indexed string: 0xc3): quad_t
    <8be>   DW_AT_decl_file   : 14
    <8bf>   DW_AT_decl_line   : 37
    <8c0>   DW_AT_decl_column : 18
    <8c1>   DW_AT_type        : <0x462>
 <1><8c5>: Abbrev Number: 2 (DW_TAG_typedef)
    <8c6>   DW_AT_name        : (indexed string: 0x799): u_quad_t
    <8c8>   DW_AT_decl_file   : 14
    <8c9>   DW_AT_decl_line   : 38
    <8ca>   DW_AT_decl_column : 20
    <8cb>   DW_AT_type        : <0x46c>
 <1><8cf>: Abbrev Number: 2 (DW_TAG_typedef)
    <8d0>   DW_AT_name        : (indexed string: 0xda0): fsid_t
    <8d2>   DW_AT_decl_file   : 14
    <8d3>   DW_AT_decl_line   : 39
    <8d4>   DW_AT_decl_column : 18
    <8d5>   DW_AT_type        : <0x513>
 <1><8d9>: Abbrev Number: 2 (DW_TAG_typedef)
    <8da>   DW_AT_name        : (indexed string: 0xa1e): loff_t
    <8dc>   DW_AT_decl_file   : 14
    <8dd>   DW_AT_decl_line   : 42
    <8de>   DW_AT_decl_column : 18
    <8df>   DW_AT_type        : <0x5f9>
 <1><8e3>: Abbrev Number: 2 (DW_TAG_typedef)
    <8e4>   DW_AT_name        : (indexed string: 0x5e2): ino_t
    <8e6>   DW_AT_decl_file   : 14
    <8e7>   DW_AT_decl_line   : 47
    <8e8>   DW_AT_decl_column : 17
    <8e9>   DW_AT_type        : <0x4a8>
 <1><8ed>: Abbrev Number: 2 (DW_TAG_typedef)
    <8ee>   DW_AT_name        : (indexed string: 0x16f): dev_t
    <8f0>   DW_AT_decl_file   : 14
    <8f1>   DW_AT_decl_line   : 59
    <8f2>   DW_AT_decl_column : 17
    <8f3>   DW_AT_type        : <0x48a>
 <1><8f7>: Abbrev Number: 2 (DW_TAG_typedef)
    <8f8>   DW_AT_name        : (indexed string: 0xde3): gid_t
    <8fa>   DW_AT_decl_file   : 14
    <8fb>   DW_AT_decl_line   : 64
    <8fc>   DW_AT_decl_column : 17
    <8fd>   DW_AT_type        : <0x49e>
 <1><901>: Abbrev Number: 2 (DW_TAG_typedef)
    <902>   DW_AT_name        : (indexed string: 0x5fb): mode_t
    <904>   DW_AT_decl_file   : 14
    <905>   DW_AT_decl_line   : 69
    <906>   DW_AT_decl_column : 18
    <907>   DW_AT_type        : <0x4bc>
 <1><90b>: Abbrev Number: 2 (DW_TAG_typedef)
    <90c>   DW_AT_name        : (indexed string: 0xde0): nlink_t
    <90e>   DW_AT_decl_file   : 14
    <90f>   DW_AT_decl_line   : 74
    <910>   DW_AT_decl_column : 19
    <911>   DW_AT_type        : <0x4c6>
 <1><915>: Abbrev Number: 2 (DW_TAG_typedef)
    <916>   DW_AT_name        : (indexed string: 0x945): uid_t
    <918>   DW_AT_decl_file   : 14
    <919>   DW_AT_decl_line   : 79
    <91a>   DW_AT_decl_column : 17
    <91b>   DW_AT_type        : <0x494>
 <1><91f>: Abbrev Number: 2 (DW_TAG_typedef)
    <920>   DW_AT_name        : (indexed string: 0x99a): off_t
    <922>   DW_AT_decl_file   : 14
    <923>   DW_AT_decl_line   : 85
    <924>   DW_AT_decl_column : 17
    <925>   DW_AT_type        : <0x4d0>
 <1><929>: Abbrev Number: 2 (DW_TAG_typedef)
    <92a>   DW_AT_name        : (indexed string: 0xce): pid_t
    <92c>   DW_AT_decl_file   : 14
    <92d>   DW_AT_decl_line   : 97
    <92e>   DW_AT_decl_column : 17
    <92f>   DW_AT_type        : <0x4e4>
 <1><933>: Abbrev Number: 2 (DW_TAG_typedef)
    <934>   DW_AT_name        : (indexed string: 0xfae): id_t
    <936>   DW_AT_decl_file   : 14
    <937>   DW_AT_decl_line   : 103
    <938>   DW_AT_decl_column : 16
    <939>   DW_AT_type        : <0x53b>
 <1><93d>: Abbrev Number: 2 (DW_TAG_typedef)
    <93e>   DW_AT_name        : (indexed string: 0xf75): ssize_t
    <940>   DW_AT_decl_file   : 14
    <941>   DW_AT_decl_line   : 108
    <942>   DW_AT_decl_column : 19
    <943>   DW_AT_type        : <0x5db>
 <1><947>: Abbrev Number: 2 (DW_TAG_typedef)
    <948>   DW_AT_name        : (indexed string: 0x2a7): daddr_t
    <94a>   DW_AT_decl_file   : 14
    <94b>   DW_AT_decl_line   : 114
    <94c>   DW_AT_decl_column : 19
    <94d>   DW_AT_type        : <0x563>
 <1><951>: Abbrev Number: 2 (DW_TAG_typedef)
    <952>   DW_AT_name        : (indexed string: 0x410): caddr_t
    <954>   DW_AT_decl_file   : 14
    <955>   DW_AT_decl_line   : 115
    <956>   DW_AT_decl_column : 19
    <957>   DW_AT_type        : <0x603>
 <1><95b>: Abbrev Number: 2 (DW_TAG_typedef)
    <95c>   DW_AT_name        : (indexed string: 0xb08): key_t
    <95e>   DW_AT_decl_file   : 14
    <95f>   DW_AT_decl_line   : 121
    <960>   DW_AT_decl_column : 17
    <961>   DW_AT_type        : <0x56d>
 <1><965>: Abbrev Number: 2 (DW_TAG_typedef)
    <966>   DW_AT_name        : (indexed string: 0xd3b): clock_t
    <968>   DW_AT_decl_file   : 15
    <969>   DW_AT_decl_line   : 7
    <96a>   DW_AT_decl_column : 19
    <96b>   DW_AT_type        : <0x51d>
 <1><96f>: Abbrev Number: 2 (DW_TAG_typedef)
    <970>   DW_AT_name        : (indexed string: 0xc79): clockid_t
    <972>   DW_AT_decl_file   : 16
    <973>   DW_AT_decl_line   : 7
    <974>   DW_AT_decl_column : 21
    <975>   DW_AT_type        : <0x577>
 <1><979>: Abbrev Number: 2 (DW_TAG_typedef)
    <97a>   DW_AT_name        : (indexed string: 0x1bd): time_t
    <97c>   DW_AT_decl_file   : 17
    <97d>   DW_AT_decl_line   : 7
    <97e>   DW_AT_decl_column : 18
    <97f>   DW_AT_type        : <0x545>
 <1><983>: Abbrev Number: 2 (DW_TAG_typedef)
    <984>   DW_AT_name        : (indexed string: 0x681): timer_t
    <986>   DW_AT_decl_file   : 18
    <987>   DW_AT_decl_line   : 7
    <988>   DW_AT_decl_column : 19
    <989>   DW_AT_type        : <0x581>
 <1><98d>: Abbrev Number: 2 (DW_TAG_typedef)
    <98e>   DW_AT_name        : (indexed string: 0xe53): ulong
    <990>   DW_AT_decl_file   : 14
    <991>   DW_AT_decl_line   : 148
    <992>   DW_AT_decl_column : 27
    <993>   DW_AT_type        : <0x40>
 <1><997>: Abbrev Number: 2 (DW_TAG_typedef)
    <998>   DW_AT_name        : (indexed string: 0x7): ushort
    <999>   DW_AT_decl_file   : 14
    <99a>   DW_AT_decl_line   : 149
    <99b>   DW_AT_decl_column : 28
    <99c>   DW_AT_type        : <0x39a>
 <1><9a0>: Abbrev Number: 2 (DW_TAG_typedef)
    <9a1>   DW_AT_name        : (indexed string: 0x755): uint
    <9a3>   DW_AT_decl_file   : 14
    <9a4>   DW_AT_decl_line   : 150
    <9a5>   DW_AT_decl_column : 22
    <9a6>   DW_AT_type        : <0x77>
 <1><9aa>: Abbrev Number: 2 (DW_TAG_typedef)
    <9ab>   DW_AT_name        : (indexed string: 0x72b): u_int8_t
    <9ad>   DW_AT_decl_file   : 14
    <9ae>   DW_AT_decl_line   : 158
    <9af>   DW_AT_decl_column : 19
    <9b0>   DW_AT_type        : <0x3c7>
 <1><9b4>: Abbrev Number: 2 (DW_TAG_typedef)
    <9b5>   DW_AT_name        : (indexed string: 0x693): u_int16_t
    <9b7>   DW_AT_decl_file   : 14
    <9b8>   DW_AT_decl_line   : 159
    <9b9>   DW_AT_decl_column : 20
    <9ba>   DW_AT_type        : <0x3e0>
 <1><9be>: Abbrev Number: 2 (DW_TAG_typedef)
    <9bf>   DW_AT_name        : (indexed string: 0x336): u_int32_t
    <9c1>   DW_AT_decl_file   : 14
    <9c2>   DW_AT_decl_line   : 160
    <9c3>   DW_AT_decl_column : 20
    <9c4>   DW_AT_type        : <0x3f4>
 <1><9c8>: Abbrev Number: 2 (DW_TAG_typedef)
    <9c9>   DW_AT_name        : (indexed string: 0xe93): u_int64_t
    <9cb>   DW_AT_decl_file   : 14
    <9cc>   DW_AT_decl_line   : 161
    <9cd>   DW_AT_decl_column : 20
    <9ce>   DW_AT_type        : <0x408>
 <1><9d2>: Abbrev Number: 2 (DW_TAG_typedef)
    <9d3>   DW_AT_name        : (indexed string: 0x329): register_t
    <9d5>   DW_AT_decl_file   : 14
    <9d6>   DW_AT_decl_line   : 164
    <9d7>   DW_AT_decl_column : 13
    <9d8>   DW_AT_type        : <0x92>
 <1><9dc>: Abbrev Number: 25 (DW_TAG_structure_type)
    <9dd>   DW_AT_byte_size   : 128
    <9de>   DW_AT_decl_file   : 19
    <9df>   DW_AT_decl_line   : 5
    <9e0>   DW_AT_decl_column : 9
    <9e1>   DW_AT_sibling     : <0x9f1>
 <2><9e5>: Abbrev Number: 26 (DW_TAG_member)
    <9e6>   DW_AT_name        : (indexed string: 0xe77): __val
    <9e8>   DW_AT_decl_file   : 19
    <9e9>   DW_AT_decl_line   : 7
    <9ea>   DW_AT_decl_column : 21
    <9eb>   DW_AT_type        : <0x9f1>
    <9ef>   DW_AT_data_member_location: 0
 <2><9f0>: Abbrev Number: 0
 <1><9f1>: Abbrev Number: 4 (DW_TAG_array_type)
    <9f2>   DW_AT_type        : <0x40>
    <9f6>   DW_AT_sibling     : <0xa01>
 <2><9fa>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <9fb>   DW_AT_type        : <0x40>
    <9ff>   DW_AT_upper_bound : 15
 <2><a00>: Abbrev Number: 0
 <1><a01>: Abbrev Number: 2 (DW_TAG_typedef)
    <a02>   DW_AT_name        : (indexed string: 0xc44): __sigset_t
    <a04>   DW_AT_decl_file   : 19
    <a05>   DW_AT_decl_line   : 8
    <a06>   DW_AT_decl_column : 3
    <a07>   DW_AT_type        : <0x9dc>
 <1><a0b>: Abbrev Number: 2 (DW_TAG_typedef)
    <a0c>   DW_AT_name        : (indexed string: 0x4a9): sigset_t
    <a0e>   DW_AT_decl_file   : 20
    <a0f>   DW_AT_decl_line   : 7
    <a10>   DW_AT_decl_column : 20
    <a11>   DW_AT_type        : <0xa01>
 <1><a15>: Abbrev Number: 27 (DW_TAG_structure_type)
    <a16>   DW_AT_name        : (indexed string: 0x9a3): timeval
    <a18>   DW_AT_byte_size   : 16
    <a19>   DW_AT_decl_file   : 21
    <a1a>   DW_AT_decl_line   : 8
    <a1b>   DW_AT_decl_column : 8
    <a1c>   DW_AT_sibling     : <0xa37>
 <2><a20>: Abbrev Number: 26 (DW_TAG_member)
    <a21>   DW_AT_name        : (indexed string: 0xc39): tv_sec
    <a23>   DW_AT_decl_file   : 21
    <a24>   DW_AT_decl_line   : 10
    <a25>   DW_AT_decl_column : 12
    <a26>   DW_AT_type        : <0x545>
    <a2a>   DW_AT_data_member_location: 0
 <2><a2b>: Abbrev Number: 26 (DW_TAG_member)
    <a2c>   DW_AT_name        : (indexed string: 0x678): tv_usec
    <a2e>   DW_AT_decl_file   : 21
    <a2f>   DW_AT_decl_line   : 11
    <a30>   DW_AT_decl_column : 17
    <a31>   DW_AT_type        : <0x559>
    <a35>   DW_AT_data_member_location: 8
 <2><a36>: Abbrev Number: 0
 <1><a37>: Abbrev Number: 27 (DW_TAG_structure_type)
    <a38>   DW_AT_name        : (indexed string: 0x326): timespec
    <a3a>   DW_AT_byte_size   : 16
    <a3b>   DW_AT_decl_file   : 22
    <a3c>   DW_AT_decl_line   : 10
    <a3d>   DW_AT_decl_column : 8
    <a3e>   DW_AT_sibling     : <0xa59>
 <2><a42>: Abbrev Number: 26 (DW_TAG_member)
    <a43>   DW_AT_name        : (indexed string: 0xc39): tv_sec
    <a45>   DW_AT_decl_file   : 22
    <a46>   DW_AT_decl_line   : 12
    <a47>   DW_AT_decl_column : 12
    <a48>   DW_AT_type        : <0x545>
    <a4c>   DW_AT_data_member_location: 0
 <2><a4d>: Abbrev Number: 26 (DW_TAG_member)
    <a4e>   DW_AT_name        : (indexed string: 0x5ef): tv_nsec
    <a50>   DW_AT_decl_file   : 22
    <a51>   DW_AT_decl_line   : 16
    <a52>   DW_AT_decl_column : 21
    <a53>   DW_AT_type        : <0x5e5>
    <a57>   DW_AT_data_member_location: 8
 <2><a58>: Abbrev Number: 0
 <1><a59>: Abbrev Number: 2 (DW_TAG_typedef)
    <a5a>   DW_AT_name        : (indexed string: 0xbca): suseconds_t
    <a5c>   DW_AT_decl_file   : 23
    <a5d>   DW_AT_decl_line   : 43
    <a5e>   DW_AT_decl_column : 23
    <a5f>   DW_AT_type        : <0x559>
 <1><a63>: Abbrev Number: 2 (DW_TAG_typedef)
    <a64>   DW_AT_name        : (indexed string: 0x32e): __fd_mask
    <a66>   DW_AT_decl_file   : 23
    <a67>   DW_AT_decl_line   : 49
    <a68>   DW_AT_decl_column : 18
    <a69>   DW_AT_type        : <0x92>
 <1><a6d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <a6e>   DW_AT_byte_size   : 128
    <a6f>   DW_AT_decl_file   : 23
    <a70>   DW_AT_decl_line   : 59
    <a71>   DW_AT_decl_column : 9
    <a72>   DW_AT_sibling     : <0xa82>
 <2><a76>: Abbrev Number: 26 (DW_TAG_member)
    <a77>   DW_AT_name        : (indexed string: 0x56b): __fds_bits
    <a79>   DW_AT_decl_file   : 23
    <a7a>   DW_AT_decl_line   : 67
    <a7b>   DW_AT_decl_column : 15
    <a7c>   DW_AT_type        : <0xa82>
    <a80>   DW_AT_data_member_location: 0
 <2><a81>: Abbrev Number: 0
 <1><a82>: Abbrev Number: 4 (DW_TAG_array_type)
    <a83>   DW_AT_type        : <0xa63>
    <a87>   DW_AT_sibling     : <0xa92>
 <2><a8b>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <a8c>   DW_AT_type        : <0x40>
    <a90>   DW_AT_upper_bound : 15
 <2><a91>: Abbrev Number: 0
 <1><a92>: Abbrev Number: 2 (DW_TAG_typedef)
    <a93>   DW_AT_name        : (indexed string: 0x9d1): fd_set
    <a95>   DW_AT_decl_file   : 23
    <a96>   DW_AT_decl_line   : 70
    <a97>   DW_AT_decl_column : 5
    <a98>   DW_AT_type        : <0xa6d>
 <1><a9c>: Abbrev Number: 2 (DW_TAG_typedef)
    <a9d>   DW_AT_name        : (indexed string: 0x798): fd_mask
    <a9f>   DW_AT_decl_file   : 23
    <aa0>   DW_AT_decl_line   : 77
    <aa1>   DW_AT_decl_column : 19
    <aa2>   DW_AT_type        : <0xa63>
 <1><aa6>: Abbrev Number: 2 (DW_TAG_typedef)
    <aa7>   DW_AT_name        : (indexed string: 0x29f): blksize_t
    <aa9>   DW_AT_decl_file   : 14
    <aaa>   DW_AT_decl_line   : 185
    <aab>   DW_AT_decl_column : 21
    <aac>   DW_AT_type        : <0x58b>
 <1><ab0>: Abbrev Number: 2 (DW_TAG_typedef)
    <ab1>   DW_AT_name        : (indexed string: 0x9bf): blkcnt_t
    <ab3>   DW_AT_decl_file   : 14
    <ab4>   DW_AT_decl_line   : 192
    <ab5>   DW_AT_decl_column : 20
    <ab6>   DW_AT_type        : <0x595>
 <1><aba>: Abbrev Number: 2 (DW_TAG_typedef)
    <abb>   DW_AT_name        : (indexed string: 0x43d): fsblkcnt_t
    <abd>   DW_AT_decl_file   : 14
    <abe>   DW_AT_decl_line   : 196
    <abf>   DW_AT_decl_column : 22
    <ac0>   DW_AT_type        : <0x5a9>
 <1><ac4>: Abbrev Number: 2 (DW_TAG_typedef)
    <ac5>   DW_AT_name        : (indexed string: 0xedf): fsfilcnt_t
    <ac7>   DW_AT_decl_file   : 14
    <ac8>   DW_AT_decl_line   : 200
    <ac9>   DW_AT_decl_column : 22
    <aca>   DW_AT_type        : <0x5bd>
 <1><ace>: Abbrev Number: 27 (DW_TAG_structure_type)
    <acf>   DW_AT_name        : (indexed string: 0xe67): __pthread_internal_list
    <ad1>   DW_AT_byte_size   : 16
    <ad2>   DW_AT_decl_file   : 24
    <ad3>   DW_AT_decl_line   : 49
    <ad4>   DW_AT_decl_column : 16
    <ad5>   DW_AT_sibling     : <0xaf0>
 <2><ad9>: Abbrev Number: 26 (DW_TAG_member)
    <ada>   DW_AT_name        : (indexed string: 0x9b1): __prev
    <adc>   DW_AT_decl_file   : 24
    <add>   DW_AT_decl_line   : 51
    <ade>   DW_AT_decl_column : 35
    <adf>   DW_AT_type        : <0xaf0>
    <ae3>   DW_AT_data_member_location: 0
 <2><ae4>: Abbrev Number: 26 (DW_TAG_member)
    <ae5>   DW_AT_name        : (indexed string: 0xee8): __next
    <ae7>   DW_AT_decl_file   : 24
    <ae8>   DW_AT_decl_line   : 52
    <ae9>   DW_AT_decl_column : 35
    <aea>   DW_AT_type        : <0xaf0>
    <aee>   DW_AT_data_member_location: 8
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <af1>   DW_AT_byte_size   : 8
    <af2>   DW_AT_type        : <0xace>
 <1><af6>: Abbrev Number: 2 (DW_TAG_typedef)
    <af7>   DW_AT_name        : (indexed string: 0x2d8): __pthread_list_t
    <af9>   DW_AT_decl_file   : 24
    <afa>   DW_AT_decl_line   : 53
    <afb>   DW_AT_decl_column : 3
    <afc>   DW_AT_type        : <0xace>
 <1><b00>: Abbrev Number: 27 (DW_TAG_structure_type)
    <b01>   DW_AT_name        : (indexed string: 0xe22): __pthread_internal_slist
    <b03>   DW_AT_byte_size   : 8
    <b04>   DW_AT_decl_file   : 24
    <b05>   DW_AT_decl_line   : 55
    <b06>   DW_AT_decl_column : 16
    <b07>   DW_AT_sibling     : <0xb17>
 <2><b0b>: Abbrev Number: 26 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indexed string: 0xee8): __next
    <b0e>   DW_AT_decl_file   : 24
    <b0f>   DW_AT_decl_line   : 57
    <b10>   DW_AT_decl_column : 36
    <b11>   DW_AT_type        : <0xb17>
    <b15>   DW_AT_data_member_location: 0
 <2><b16>: Abbrev Number: 0
 <1><b17>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <b18>   DW_AT_byte_size   : 8
    <b19>   DW_AT_type        : <0xb00>
 <1><b1d>: Abbrev Number: 2 (DW_TAG_typedef)
    <b1e>   DW_AT_name        : (indexed string: 0xaaf): __pthread_slist_t
    <b20>   DW_AT_decl_file   : 24
    <b21>   DW_AT_decl_line   : 58
    <b22>   DW_AT_decl_column : 3
    <b23>   DW_AT_type        : <0xb00>
 <1><b27>: Abbrev Number: 27 (DW_TAG_structure_type)
    <b28>   DW_AT_name        : (indexed string: 0xd25): __pthread_mutex_s
    <b2a>   DW_AT_byte_size   : 40
    <b2b>   DW_AT_decl_file   : 25
    <b2c>   DW_AT_decl_line   : 22
    <b2d>   DW_AT_decl_column : 8
    <b2e>   DW_AT_sibling     : <0xb8b>
 <2><b32>: Abbrev Number: 26 (DW_TAG_member)
    <b33>   DW_AT_name        : (indexed string: 0xcd1): __lock
    <b35>   DW_AT_decl_file   : 25
    <b36>   DW_AT_decl_line   : 24
    <b37>   DW_AT_decl_column : 7
    <b38>   DW_AT_type        : <0xac>
    <b3c>   DW_AT_data_member_location: 0
 <2><b3d>: Abbrev Number: 26 (DW_TAG_member)
    <b3e>   DW_AT_name        : (indexed string: 0x7bf): __count
    <b40>   DW_AT_decl_file   : 25
    <b41>   DW_AT_decl_line   : 25
    <b42>   DW_AT_decl_column : 16
    <b43>   DW_AT_type        : <0x77>
    <b47>   DW_AT_data_member_location: 4
 <2><b48>: Abbrev Number: 26 (DW_TAG_member)
    <b49>   DW_AT_name        : (indexed string: 0x2c9): __owner
    <b4b>   DW_AT_decl_file   : 25
    <b4c>   DW_AT_decl_line   : 26
    <b4d>   DW_AT_decl_column : 7
    <b4e>   DW_AT_type        : <0xac>
    <b52>   DW_AT_data_member_location: 8
 <2><b53>: Abbrev Number: 26 (DW_TAG_member)
    <b54>   DW_AT_name        : (indexed string: 0x240): __nusers
    <b56>   DW_AT_decl_file   : 25
    <b57>   DW_AT_decl_line   : 28
    <b58>   DW_AT_decl_column : 16
    <b59>   DW_AT_type        : <0x77>
    <b5d>   DW_AT_data_member_location: 12
 <2><b5e>: Abbrev Number: 26 (DW_TAG_member)
    <b5f>   DW_AT_name        : (indexed string: 0xe28): __kind
    <b61>   DW_AT_decl_file   : 25
    <b62>   DW_AT_decl_line   : 32
    <b63>   DW_AT_decl_column : 7
    <b64>   DW_AT_type        : <0xac>
    <b68>   DW_AT_data_member_location: 16
 <2><b69>: Abbrev Number: 26 (DW_TAG_member)
    <b6a>   DW_AT_name        : (indexed string: 0x18b): __spins
    <b6c>   DW_AT_decl_file   : 25
    <b6d>   DW_AT_decl_line   : 34
    <b6e>   DW_AT_decl_column : 9
    <b6f>   DW_AT_type        : <0x3db>
    <b73>   DW_AT_data_member_location: 20
 <2><b74>: Abbrev Number: 26 (DW_TAG_member)
    <b75>   DW_AT_name        : (indexed string: 0xfe0): __elision
    <b77>   DW_AT_decl_file   : 25
    <b78>   DW_AT_decl_line   : 35
    <b79>   DW_AT_decl_column : 9
    <b7a>   DW_AT_type        : <0x3db>
    <b7e>   DW_AT_data_member_location: 22
 <2><b7f>: Abbrev Number: 26 (DW_TAG_member)
    <b80>   DW_AT_name        : (indexed string: 0x4a7): __list
    <b82>   DW_AT_decl_file   : 25
    <b83>   DW_AT_decl_line   : 36
    <b84>   DW_AT_decl_column : 20
    <b85>   DW_AT_type        : <0xaf6>
    <b89>   DW_AT_data_member_location: 24
 <2><b8a>: Abbrev Number: 0
 <1><b8b>: Abbrev Number: 27 (DW_TAG_structure_type)
    <b8c>   DW_AT_name        : (indexed string: 0x994): __pthread_rwlock_arch_t
    <b8e>   DW_AT_byte_size   : 56
    <b8f>   DW_AT_decl_file   : 26
    <b90>   DW_AT_decl_line   : 23
    <b91>   DW_AT_decl_column : 8
    <b92>   DW_AT_sibling     : <0xc17>
 <2><b96>: Abbrev Number: 26 (DW_TAG_member)
    <b97>   DW_AT_name        : (indexed string: 0x814): __readers
    <b99>   DW_AT_decl_file   : 26
    <b9a>   DW_AT_decl_line   : 25
    <b9b>   DW_AT_decl_column : 16
    <b9c>   DW_AT_type        : <0x77>
    <ba0>   DW_AT_data_member_location: 0
 <2><ba1>: Abbrev Number: 26 (DW_TAG_member)
    <ba2>   DW_AT_name        : (indexed string: 0xe06): __writers
    <ba4>   DW_AT_decl_file   : 26
    <ba5>   DW_AT_decl_line   : 26
    <ba6>   DW_AT_decl_column : 16
    <ba7>   DW_AT_type        : <0x77>
    <bab>   DW_AT_data_member_location: 4
 <2><bac>: Abbrev Number: 26 (DW_TAG_member)
    <bad>   DW_AT_name        : (indexed string: 0x3c0): __wrphase_futex
    <baf>   DW_AT_decl_file   : 26
    <bb0>   DW_AT_decl_line   : 27
    <bb1>   DW_AT_decl_column : 16
    <bb2>   DW_AT_type        : <0x77>
    <bb6>   DW_AT_data_member_location: 8
 <2><bb7>: Abbrev Number: 26 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indexed string: 0x233): __writers_futex
    <bba>   DW_AT_decl_file   : 26
    <bbb>   DW_AT_decl_line   : 28
    <bbc>   DW_AT_decl_column : 16
    <bbd>   DW_AT_type        : <0x77>
    <bc1>   DW_AT_data_member_location: 12
 <2><bc2>: Abbrev Number: 26 (DW_TAG_member)
    <bc3>   DW_AT_name        : (indexed string: 0x2b): __pad3
    <bc4>   DW_AT_decl_file   : 26
    <bc5>   DW_AT_decl_line   : 29
    <bc6>   DW_AT_decl_column : 16
    <bc7>   DW_AT_type        : <0x77>
    <bcb>   DW_AT_data_member_location: 16
 <2><bcc>: Abbrev Number: 26 (DW_TAG_member)
    <bcd>   DW_AT_name        : (indexed string: 0x2c): __pad4
    <bce>   DW_AT_decl_file   : 26
    <bcf>   DW_AT_decl_line   : 30
    <bd0>   DW_AT_decl_column : 16
    <bd1>   DW_AT_type        : <0x77>
    <bd5>   DW_AT_data_member_location: 20
 <2><bd6>: Abbrev Number: 26 (DW_TAG_member)
    <bd7>   DW_AT_name        : (indexed string: 0xa0a): __cur_writer
    <bd9>   DW_AT_decl_file   : 26
    <bda>   DW_AT_decl_line   : 32
    <bdb>   DW_AT_decl_column : 7
    <bdc>   DW_AT_type        : <0xac>
    <be0>   DW_AT_data_member_location: 24
 <2><be1>: Abbrev Number: 26 (DW_TAG_member)
    <be2>   DW_AT_name        : (indexed string: 0xc69): __shared
    <be4>   DW_AT_decl_file   : 26
    <be5>   DW_AT_decl_line   : 33
    <be6>   DW_AT_decl_column : 7
    <be7>   DW_AT_type        : <0xac>
    <beb>   DW_AT_data_member_location: 28
 <2><bec>: Abbrev Number: 26 (DW_TAG_member)
    <bed>   DW_AT_name        : (indexed string: 0x963): __rwelision
    <bef>   DW_AT_decl_file   : 26
    <bf0>   DW_AT_decl_line   : 34
    <bf1>   DW_AT_decl_column : 15
    <bf2>   DW_AT_type        : <0x3c2>
    <bf6>   DW_AT_data_member_location: 32
 <2><bf7>: Abbrev Number: 26 (DW_TAG_member)
    <bf8>   DW_AT_name        : (indexed string: 0x29): __pad1
    <bf9>   DW_AT_decl_file   : 26
    <bfa>   DW_AT_decl_line   : 39
    <bfb>   DW_AT_decl_column : 17
    <bfc>   DW_AT_type        : <0xc17>
    <c00>   DW_AT_data_member_location: 33
 <2><c01>: Abbrev Number: 26 (DW_TAG_member)
    <c02>   DW_AT_name        : (indexed string: 0x2a): __pad2
    <c03>   DW_AT_decl_file   : 26
    <c04>   DW_AT_decl_line   : 42
    <c05>   DW_AT_decl_column : 21
    <c06>   DW_AT_type        : <0x40>
    <c0a>   DW_AT_data_member_location: 40
 <2><c0b>: Abbrev Number: 26 (DW_TAG_member)
    <c0c>   DW_AT_name        : (indexed string: 0xc6c): __flags
    <c0e>   DW_AT_decl_file   : 26
    <c0f>   DW_AT_decl_line   : 45
    <c10>   DW_AT_decl_column : 16
    <c11>   DW_AT_type        : <0x77>
    <c15>   DW_AT_data_member_location: 48
 <2><c16>: Abbrev Number: 0
 <1><c17>: Abbrev Number: 4 (DW_TAG_array_type)
    <c18>   DW_AT_type        : <0x38b>
    <c1c>   DW_AT_sibling     : <0xc27>
 <2><c20>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <c21>   DW_AT_type        : <0x40>
    <c25>   DW_AT_upper_bound : 6
 <2><c26>: Abbrev Number: 0
 <1><c27>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c28>   DW_AT_byte_size   : 8
    <c29>   DW_AT_decl_file   : 24
    <c2a>   DW_AT_decl_line   : 97
    <c2b>   DW_AT_decl_column : 5
    <c2c>   DW_AT_sibling     : <0xc47>
 <2><c30>: Abbrev Number: 26 (DW_TAG_member)
    <c31>   DW_AT_name        : (indexed string: 0x870): __low
    <c33>   DW_AT_decl_file   : 24
    <c34>   DW_AT_decl_line   : 99
    <c35>   DW_AT_decl_column : 20
    <c36>   DW_AT_type        : <0x77>
    <c3a>   DW_AT_data_member_location: 0
 <2><c3b>: Abbrev Number: 26 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indexed string: 0xaa4): __high
    <c3e>   DW_AT_decl_file   : 24
    <c3f>   DW_AT_decl_line   : 100
    <c40>   DW_AT_decl_column : 20
    <c41>   DW_AT_type        : <0x77>
    <c45>   DW_AT_data_member_location: 4
 <2><c46>: Abbrev Number: 0
 <1><c47>: Abbrev Number: 32 (DW_TAG_union_type)
    <c48>   DW_AT_byte_size   : 8
    <c49>   DW_AT_decl_file   : 24
    <c4a>   DW_AT_decl_line   : 94
    <c4b>   DW_AT_decl_column : 17
    <c4c>   DW_AT_sibling     : <0xc65>
 <2><c50>: Abbrev Number: 33 (DW_TAG_member)
    <c51>   DW_AT_name        : (indexed string: 0xead): __wseq
    <c53>   DW_AT_decl_file   : 24
    <c54>   DW_AT_decl_line   : 96
    <c55>   DW_AT_decl_column : 42
    <c56>   DW_AT_type        : <0xc65>
 <2><c5a>: Abbrev Number: 33 (DW_TAG_member)
    <c5b>   DW_AT_name        : (indexed string: 0x9fa): __wseq32
    <c5d>   DW_AT_decl_file   : 24
    <c5e>   DW_AT_decl_line   : 101
    <c5f>   DW_AT_decl_column : 7
    <c60>   DW_AT_type        : <0xc27>
 <2><c64>: Abbrev Number: 0
 <1><c65>: Abbrev Number: 6 (DW_TAG_base_type)
    <c66>   DW_AT_byte_size   : 8
    <c67>   DW_AT_encoding    : 7	(unsigned)
    <c68>   DW_AT_name        : (indexed string: 0xd3d): long long unsigned int
 <1><c6a>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c6b>   DW_AT_byte_size   : 8
    <c6c>   DW_AT_decl_file   : 24
    <c6d>   DW_AT_decl_line   : 106
    <c6e>   DW_AT_decl_column : 5
    <c6f>   DW_AT_sibling     : <0xc8a>
 <2><c73>: Abbrev Number: 26 (DW_TAG_member)
    <c74>   DW_AT_name        : (indexed string: 0x870): __low
    <c76>   DW_AT_decl_file   : 24
    <c77>   DW_AT_decl_line   : 108
    <c78>   DW_AT_decl_column : 20
    <c79>   DW_AT_type        : <0x77>
    <c7d>   DW_AT_data_member_location: 0
 <2><c7e>: Abbrev Number: 26 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indexed string: 0xaa4): __high
    <c81>   DW_AT_decl_file   : 24
    <c82>   DW_AT_decl_line   : 109
    <c83>   DW_AT_decl_column : 20
    <c84>   DW_AT_type        : <0x77>
    <c88>   DW_AT_data_member_location: 4
 <2><c89>: Abbrev Number: 0
 <1><c8a>: Abbrev Number: 32 (DW_TAG_union_type)
    <c8b>   DW_AT_byte_size   : 8
    <c8c>   DW_AT_decl_file   : 24
    <c8d>   DW_AT_decl_line   : 103
    <c8e>   DW_AT_decl_column : 17
    <c8f>   DW_AT_sibling     : <0xca8>
 <2><c93>: Abbrev Number: 33 (DW_TAG_member)
    <c94>   DW_AT_name        : (indexed string: 0x49d): __g1_start
    <c96>   DW_AT_decl_file   : 24
    <c97>   DW_AT_decl_line   : 105
    <c98>   DW_AT_decl_column : 42
    <c99>   DW_AT_type        : <0xc65>
 <2><c9d>: Abbrev Number: 33 (DW_TAG_member)
    <c9e>   DW_AT_name        : (indexed string: 0xa99): __g1_start32
    <ca0>   DW_AT_decl_file   : 24
    <ca1>   DW_AT_decl_line   : 110
    <ca2>   DW_AT_decl_column : 7
    <ca3>   DW_AT_type        : <0xc6a>
 <2><ca7>: Abbrev Number: 0
 <1><ca8>: Abbrev Number: 27 (DW_TAG_structure_type)
    <ca9>   DW_AT_name        : (indexed string: 0xeef): __pthread_cond_s
    <cab>   DW_AT_byte_size   : 48
    <cac>   DW_AT_decl_file   : 24
    <cad>   DW_AT_decl_line   : 92
    <cae>   DW_AT_decl_column : 8
    <caf>   DW_AT_sibling     : <0xcf7>
 <2><cb3>: Abbrev Number: 34 (DW_TAG_member)
    <cb4>   DW_AT_type        : <0xc47>
    <cb8>   DW_AT_data_member_location: 0
 <2><cb9>: Abbrev Number: 34 (DW_TAG_member)
    <cba>   DW_AT_type        : <0xc8a>
    <cbe>   DW_AT_data_member_location: 8
 <2><cbf>: Abbrev Number: 26 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indexed string: 0xc00): __g_refs
    <cc2>   DW_AT_decl_file   : 24
    <cc3>   DW_AT_decl_line   : 112
    <cc4>   DW_AT_decl_column : 16
    <cc5>   DW_AT_type        : <0xcf7>
    <cc9>   DW_AT_data_member_location: 16
 <2><cca>: Abbrev Number: 26 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indexed string: 0xd2b): __g_size
    <ccd>   DW_AT_decl_file   : 24
    <cce>   DW_AT_decl_line   : 113
    <ccf>   DW_AT_decl_column : 16
    <cd0>   DW_AT_type        : <0xcf7>
    <cd4>   DW_AT_data_member_location: 24
 <2><cd5>: Abbrev Number: 26 (DW_TAG_member)
    <cd6>   DW_AT_name        : (indexed string: 0xd92): __g1_orig_size
    <cd8>   DW_AT_decl_file   : 24
    <cd9>   DW_AT_decl_line   : 114
    <cda>   DW_AT_decl_column : 16
    <cdb>   DW_AT_type        : <0x77>
    <cdf>   DW_AT_data_member_location: 32
 <2><ce0>: Abbrev Number: 26 (DW_TAG_member)
    <ce1>   DW_AT_name        : (indexed string: 0x7cd): __wrefs
    <ce3>   DW_AT_decl_file   : 24
    <ce4>   DW_AT_decl_line   : 115
    <ce5>   DW_AT_decl_column : 16
    <ce6>   DW_AT_type        : <0x77>
    <cea>   DW_AT_data_member_location: 36
 <2><ceb>: Abbrev Number: 26 (DW_TAG_member)
    <cec>   DW_AT_name        : (indexed string: 0x89): __g_signals
    <cee>   DW_AT_decl_file   : 24
    <cef>   DW_AT_decl_line   : 116
    <cf0>   DW_AT_decl_column : 16
    <cf1>   DW_AT_type        : <0xcf7>
    <cf5>   DW_AT_data_member_location: 40
 <2><cf6>: Abbrev Number: 0
 <1><cf7>: Abbrev Number: 4 (DW_TAG_array_type)
    <cf8>   DW_AT_type        : <0x77>
    <cfc>   DW_AT_sibling     : <0xd07>
 <2><d00>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <d01>   DW_AT_type        : <0x40>
    <d05>   DW_AT_upper_bound : 1
 <2><d06>: Abbrev Number: 0
 <1><d07>: Abbrev Number: 2 (DW_TAG_typedef)
    <d08>   DW_AT_name        : (indexed string: 0xdf6): pthread_t
    <d0a>   DW_AT_decl_file   : 27
    <d0b>   DW_AT_decl_line   : 27
    <d0c>   DW_AT_decl_column : 27
    <d0d>   DW_AT_type        : <0x40>
 <1><d11>: Abbrev Number: 32 (DW_TAG_union_type)
    <d12>   DW_AT_byte_size   : 4
    <d13>   DW_AT_decl_file   : 27
    <d14>   DW_AT_decl_line   : 32
    <d15>   DW_AT_decl_column : 9
    <d16>   DW_AT_sibling     : <0xd2f>
 <2><d1a>: Abbrev Number: 33 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indexed string: 0xbaa): __size
    <d1d>   DW_AT_decl_file   : 27
    <d1e>   DW_AT_decl_line   : 34
    <d1f>   DW_AT_decl_column : 8
    <d20>   DW_AT_type        : <0xd2f>
 <2><d24>: Abbrev Number: 33 (DW_TAG_member)
    <d25>   DW_AT_name        : (indexed string: 0x644): __align
    <d27>   DW_AT_decl_file   : 27
    <d28>   DW_AT_decl_line   : 35
    <d29>   DW_AT_decl_column : 7
    <d2a>   DW_AT_type        : <0xac>
 <2><d2e>: Abbrev Number: 0
 <1><d2f>: Abbrev Number: 4 (DW_TAG_array_type)
    <d30>   DW_AT_type        : <0x222>
    <d34>   DW_AT_sibling     : <0xd3f>
 <2><d38>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <d39>   DW_AT_type        : <0x40>
    <d3d>   DW_AT_upper_bound : 3
 <2><d3e>: Abbrev Number: 0
 <1><d3f>: Abbrev Number: 2 (DW_TAG_typedef)
    <d40>   DW_AT_name        : (indexed string: 0x13f): pthread_mutexattr_t
    <d42>   DW_AT_decl_file   : 27
    <d43>   DW_AT_decl_line   : 36
    <d44>   DW_AT_decl_column : 3
    <d45>   DW_AT_type        : <0xd11>
 <1><d49>: Abbrev Number: 32 (DW_TAG_union_type)
    <d4a>   DW_AT_byte_size   : 4
    <d4b>   DW_AT_decl_file   : 27
    <d4c>   DW_AT_decl_line   : 41
    <d4d>   DW_AT_decl_column : 9
    <d4e>   DW_AT_sibling     : <0xd67>
 <2><d52>: Abbrev Number: 33 (DW_TAG_member)
    <d53>   DW_AT_name        : (indexed string: 0xbaa): __size
    <d55>   DW_AT_decl_file   : 27
    <d56>   DW_AT_decl_line   : 43
    <d57>   DW_AT_decl_column : 8
    <d58>   DW_AT_type        : <0xd2f>
 <2><d5c>: Abbrev Number: 33 (DW_TAG_member)
    <d5d>   DW_AT_name        : (indexed string: 0x644): __align
    <d5f>   DW_AT_decl_file   : 27
    <d60>   DW_AT_decl_line   : 44
    <d61>   DW_AT_decl_column : 7
    <d62>   DW_AT_type        : <0xac>
 <2><d66>: Abbrev Number: 0
 <1><d67>: Abbrev Number: 2 (DW_TAG_typedef)
    <d68>   DW_AT_name        : (indexed string: 0xa08): pthread_condattr_t
    <d6a>   DW_AT_decl_file   : 27
    <d6b>   DW_AT_decl_line   : 45
    <d6c>   DW_AT_decl_column : 3
    <d6d>   DW_AT_type        : <0xd49>
 <1><d71>: Abbrev Number: 2 (DW_TAG_typedef)
    <d72>   DW_AT_name        : (indexed string: 0x1f6): pthread_key_t
    <d74>   DW_AT_decl_file   : 27
    <d75>   DW_AT_decl_line   : 49
    <d76>   DW_AT_decl_column : 22
    <d77>   DW_AT_type        : <0x77>
 <1><d7b>: Abbrev Number: 2 (DW_TAG_typedef)
    <d7c>   DW_AT_name        : (indexed string: 0x2ff): pthread_once_t
    <d7e>   DW_AT_decl_file   : 27
    <d7f>   DW_AT_decl_line   : 53
    <d80>   DW_AT_decl_column : 30
    <d81>   DW_AT_type        : <0xac>
 <1><d85>: Abbrev Number: 35 (DW_TAG_union_type)
    <d86>   DW_AT_name        : (indexed string: 0x17e): pthread_attr_t
    <d88>   DW_AT_byte_size   : 56
    <d89>   DW_AT_decl_file   : 27
    <d8a>   DW_AT_decl_line   : 56
    <d8b>   DW_AT_decl_column : 7
    <d8c>   DW_AT_sibling     : <0xda5>
 <2><d90>: Abbrev Number: 33 (DW_TAG_member)
    <d91>   DW_AT_name        : (indexed string: 0xbaa): __size
    <d93>   DW_AT_decl_file   : 27
    <d94>   DW_AT_decl_line   : 58
    <d95>   DW_AT_decl_column : 8
    <d96>   DW_AT_type        : <0xda5>
 <2><d9a>: Abbrev Number: 33 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indexed string: 0x644): __align
    <d9d>   DW_AT_decl_file   : 27
    <d9e>   DW_AT_decl_line   : 59
    <d9f>   DW_AT_decl_column : 12
    <da0>   DW_AT_type        : <0x92>
 <2><da4>: Abbrev Number: 0
 <1><da5>: Abbrev Number: 4 (DW_TAG_array_type)
    <da6>   DW_AT_type        : <0x222>
    <daa>   DW_AT_sibling     : <0xdb5>
 <2><dae>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <daf>   DW_AT_type        : <0x40>
    <db3>   DW_AT_upper_bound : 55
 <2><db4>: Abbrev Number: 0
 <1><db5>: Abbrev Number: 2 (DW_TAG_typedef)
    <db6>   DW_AT_name        : (indexed string: 0x17e): pthread_attr_t
    <db8>   DW_AT_decl_file   : 27
    <db9>   DW_AT_decl_line   : 62
    <dba>   DW_AT_decl_column : 30
    <dbb>   DW_AT_type        : <0xd85>
 <1><dbf>: Abbrev Number: 32 (DW_TAG_union_type)
    <dc0>   DW_AT_byte_size   : 40
    <dc1>   DW_AT_decl_file   : 27
    <dc2>   DW_AT_decl_line   : 67
    <dc3>   DW_AT_decl_column : 9
    <dc4>   DW_AT_sibling     : <0xde7>
 <2><dc8>: Abbrev Number: 33 (DW_TAG_member)
    <dc9>   DW_AT_name        : (indexed string: 0x824): __data
    <dcb>   DW_AT_decl_file   : 27
    <dcc>   DW_AT_decl_line   : 69
    <dcd>   DW_AT_decl_column : 28
    <dce>   DW_AT_type        : <0xb27>
 <2><dd2>: Abbrev Number: 33 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indexed string: 0xbaa): __size
    <dd5>   DW_AT_decl_file   : 27
    <dd6>   DW_AT_decl_line   : 70
    <dd7>   DW_AT_decl_column : 8
    <dd8>   DW_AT_type        : <0xde7>
 <2><ddc>: Abbrev Number: 33 (DW_TAG_member)
    <ddd>   DW_AT_name        : (indexed string: 0x644): __align
    <ddf>   DW_AT_decl_file   : 27
    <de0>   DW_AT_decl_line   : 71
    <de1>   DW_AT_decl_column : 12
    <de2>   DW_AT_type        : <0x92>
 <2><de6>: Abbrev Number: 0
 <1><de7>: Abbrev Number: 4 (DW_TAG_array_type)
    <de8>   DW_AT_type        : <0x222>
    <dec>   DW_AT_sibling     : <0xdf7>
 <2><df0>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <df1>   DW_AT_type        : <0x40>
    <df5>   DW_AT_upper_bound : 39
 <2><df6>: Abbrev Number: 0
 <1><df7>: Abbrev Number: 2 (DW_TAG_typedef)
    <df8>   DW_AT_name        : (indexed string: 0x7df): pthread_mutex_t
    <dfa>   DW_AT_decl_file   : 27
    <dfb>   DW_AT_decl_line   : 72
    <dfc>   DW_AT_decl_column : 3
    <dfd>   DW_AT_type        : <0xdbf>
 <1><e01>: Abbrev Number: 32 (DW_TAG_union_type)
    <e02>   DW_AT_byte_size   : 48
    <e03>   DW_AT_decl_file   : 27
    <e04>   DW_AT_decl_line   : 75
    <e05>   DW_AT_decl_column : 9
    <e06>   DW_AT_sibling     : <0xe29>
 <2><e0a>: Abbrev Number: 33 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indexed string: 0x824): __data
    <e0d>   DW_AT_decl_file   : 27
    <e0e>   DW_AT_decl_line   : 77
    <e0f>   DW_AT_decl_column : 27
    <e10>   DW_AT_type        : <0xca8>
 <2><e14>: Abbrev Number: 33 (DW_TAG_member)
    <e15>   DW_AT_name        : (indexed string: 0xbaa): __size
    <e17>   DW_AT_decl_file   : 27
    <e18>   DW_AT_decl_line   : 78
    <e19>   DW_AT_decl_column : 8
    <e1a>   DW_AT_type        : <0xe29>
 <2><e1e>: Abbrev Number: 33 (DW_TAG_member)
    <e1f>   DW_AT_name        : (indexed string: 0x644): __align
    <e21>   DW_AT_decl_file   : 27
    <e22>   DW_AT_decl_line   : 79
    <e23>   DW_AT_decl_column : 31
    <e24>   DW_AT_type        : <0xe3>
 <2><e28>: Abbrev Number: 0
 <1><e29>: Abbrev Number: 4 (DW_TAG_array_type)
    <e2a>   DW_AT_type        : <0x222>
    <e2e>   DW_AT_sibling     : <0xe39>
 <2><e32>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e33>   DW_AT_type        : <0x40>
    <e37>   DW_AT_upper_bound : 47
 <2><e38>: Abbrev Number: 0
 <1><e39>: Abbrev Number: 2 (DW_TAG_typedef)
    <e3a>   DW_AT_name        : (indexed string: 0xf5a): pthread_cond_t
    <e3c>   DW_AT_decl_file   : 27
    <e3d>   DW_AT_decl_line   : 80
    <e3e>   DW_AT_decl_column : 3
    <e3f>   DW_AT_type        : <0xe01>
 <1><e43>: Abbrev Number: 32 (DW_TAG_union_type)
    <e44>   DW_AT_byte_size   : 56
    <e45>   DW_AT_decl_file   : 27
    <e46>   DW_AT_decl_line   : 86
    <e47>   DW_AT_decl_column : 9
    <e48>   DW_AT_sibling     : <0xe6b>
 <2><e4c>: Abbrev Number: 33 (DW_TAG_member)
    <e4d>   DW_AT_name        : (indexed string: 0x824): __data
    <e4f>   DW_AT_decl_file   : 27
    <e50>   DW_AT_decl_line   : 88
    <e51>   DW_AT_decl_column : 34
    <e52>   DW_AT_type        : <0xb8b>
 <2><e56>: Abbrev Number: 33 (DW_TAG_member)
    <e57>   DW_AT_name        : (indexed string: 0xbaa): __size
    <e59>   DW_AT_decl_file   : 27
    <e5a>   DW_AT_decl_line   : 89
    <e5b>   DW_AT_decl_column : 8
    <e5c>   DW_AT_type        : <0xda5>
 <2><e60>: Abbrev Number: 33 (DW_TAG_member)
    <e61>   DW_AT_name        : (indexed string: 0x644): __align
    <e63>   DW_AT_decl_file   : 27
    <e64>   DW_AT_decl_line   : 90
    <e65>   DW_AT_decl_column : 12
    <e66>   DW_AT_type        : <0x92>
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 2 (DW_TAG_typedef)
    <e6c>   DW_AT_name        : (indexed string: 0x9c1): pthread_rwlock_t
    <e6e>   DW_AT_decl_file   : 27
    <e6f>   DW_AT_decl_line   : 91
    <e70>   DW_AT_decl_column : 3
    <e71>   DW_AT_type        : <0xe43>
 <1><e75>: Abbrev Number: 32 (DW_TAG_union_type)
    <e76>   DW_AT_byte_size   : 8
    <e77>   DW_AT_decl_file   : 27
    <e78>   DW_AT_decl_line   : 93
    <e79>   DW_AT_decl_column : 9
    <e7a>   DW_AT_sibling     : <0xe93>
 <2><e7e>: Abbrev Number: 33 (DW_TAG_member)
    <e7f>   DW_AT_name        : (indexed string: 0xbaa): __size
    <e81>   DW_AT_decl_file   : 27
    <e82>   DW_AT_decl_line   : 95
    <e83>   DW_AT_decl_column : 8
    <e84>   DW_AT_type        : <0xe93>
 <2><e88>: Abbrev Number: 33 (DW_TAG_member)
    <e89>   DW_AT_name        : (indexed string: 0x644): __align
    <e8b>   DW_AT_decl_file   : 27
    <e8c>   DW_AT_decl_line   : 96
    <e8d>   DW_AT_decl_column : 12
    <e8e>   DW_AT_type        : <0x92>
 <2><e92>: Abbrev Number: 0
 <1><e93>: Abbrev Number: 4 (DW_TAG_array_type)
    <e94>   DW_AT_type        : <0x222>
    <e98>   DW_AT_sibling     : <0xea3>
 <2><e9c>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <e9d>   DW_AT_type        : <0x40>
    <ea1>   DW_AT_upper_bound : 7
 <2><ea2>: Abbrev Number: 0
 <1><ea3>: Abbrev Number: 2 (DW_TAG_typedef)
    <ea4>   DW_AT_name        : (indexed string: 0xf65): pthread_rwlockattr_t
    <ea6>   DW_AT_decl_file   : 27
    <ea7>   DW_AT_decl_line   : 97
    <ea8>   DW_AT_decl_column : 3
    <ea9>   DW_AT_type        : <0xe75>
 <1><ead>: Abbrev Number: 2 (DW_TAG_typedef)
    <eae>   DW_AT_name        : (indexed string: 0x9b): pthread_spinlock_t
    <eb0>   DW_AT_decl_file   : 27
    <eb1>   DW_AT_decl_line   : 103
    <eb2>   DW_AT_decl_column : 22
    <eb3>   DW_AT_type        : <0xb8>
 <1><eb7>: Abbrev Number: 32 (DW_TAG_union_type)
    <eb8>   DW_AT_byte_size   : 32
    <eb9>   DW_AT_decl_file   : 27
    <eba>   DW_AT_decl_line   : 108
    <ebb>   DW_AT_decl_column : 9
    <ebc>   DW_AT_sibling     : <0xed5>
 <2><ec0>: Abbrev Number: 33 (DW_TAG_member)
    <ec1>   DW_AT_name        : (indexed string: 0xbaa): __size
    <ec3>   DW_AT_decl_file   : 27
    <ec4>   DW_AT_decl_line   : 110
    <ec5>   DW_AT_decl_column : 8
    <ec6>   DW_AT_type        : <0xed5>
 <2><eca>: Abbrev Number: 33 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indexed string: 0x644): __align
    <ecd>   DW_AT_decl_file   : 27
    <ece>   DW_AT_decl_line   : 111
    <ecf>   DW_AT_decl_column : 12
    <ed0>   DW_AT_type        : <0x92>
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 4 (DW_TAG_array_type)
    <ed6>   DW_AT_type        : <0x222>
    <eda>   DW_AT_sibling     : <0xee5>
 <2><ede>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <edf>   DW_AT_type        : <0x40>
    <ee3>   DW_AT_upper_bound : 31
 <2><ee4>: Abbrev Number: 0
 <1><ee5>: Abbrev Number: 2 (DW_TAG_typedef)
    <ee6>   DW_AT_name        : (indexed string: 0x801): pthread_barrier_t
    <ee8>   DW_AT_decl_file   : 27
    <ee9>   DW_AT_decl_line   : 112
    <eea>   DW_AT_decl_column : 3
    <eeb>   DW_AT_type        : <0xeb7>
 <1><eef>: Abbrev Number: 32 (DW_TAG_union_type)
    <ef0>   DW_AT_byte_size   : 4
    <ef1>   DW_AT_decl_file   : 27
    <ef2>   DW_AT_decl_line   : 114
    <ef3>   DW_AT_decl_column : 9
    <ef4>   DW_AT_sibling     : <0xf0d>
 <2><ef8>: Abbrev Number: 33 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indexed string: 0xbaa): __size
    <efb>   DW_AT_decl_file   : 27
    <efc>   DW_AT_decl_line   : 116
    <efd>   DW_AT_decl_column : 8
    <efe>   DW_AT_type        : <0xd2f>
 <2><f02>: Abbrev Number: 33 (DW_TAG_member)
    <f03>   DW_AT_name        : (indexed string: 0x644): __align
    <f05>   DW_AT_decl_file   : 27
    <f06>   DW_AT_decl_line   : 117
    <f07>   DW_AT_decl_column : 7
    <f08>   DW_AT_type        : <0xac>
 <2><f0c>: Abbrev Number: 0
 <1><f0d>: Abbrev Number: 2 (DW_TAG_typedef)
    <f0e>   DW_AT_name        : (indexed string: 0x8d0): pthread_barrierattr_t
    <f10>   DW_AT_decl_file   : 27
    <f11>   DW_AT_decl_line   : 118
    <f12>   DW_AT_decl_column : 3
    <f13>   DW_AT_type        : <0xeef>
 <1><f17>: Abbrev Number: 17 (DW_TAG_structure_type)
    <f18>   DW_AT_name        : (indexed string: 0xf6e): random_data
    <f1a>   DW_AT_byte_size   : 48
    <f1b>   DW_AT_decl_file   : 13
    <f1c>   DW_AT_decl_line   : 423
    <f1e>   DW_AT_decl_column : 8
    <f1f>   DW_AT_sibling     : <0xf78>
 <2><f23>: Abbrev Number: 18 (DW_TAG_member)
    <f24>   DW_AT_name        : (indexed string: 0x8ff): fptr
    <f26>   DW_AT_decl_file   : 13
    <f27>   DW_AT_decl_line   : 425
    <f29>   DW_AT_decl_column : 14
    <f2a>   DW_AT_type        : <0xf78>
    <f2e>   DW_AT_data_member_location: 0
 <2><f2f>: Abbrev Number: 18 (DW_TAG_member)
    <f30>   DW_AT_name        : (indexed string: 0x2f4): rptr
    <f32>   DW_AT_decl_file   : 13
    <f33>   DW_AT_decl_line   : 426
    <f35>   DW_AT_decl_column : 14
    <f36>   DW_AT_type        : <0xf78>
    <f3a>   DW_AT_data_member_location: 8
 <2><f3b>: Abbrev Number: 18 (DW_TAG_member)
    <f3c>   DW_AT_name        : (indexed string: 0xb5f): state
    <f3e>   DW_AT_decl_file   : 13
    <f3f>   DW_AT_decl_line   : 427
    <f41>   DW_AT_decl_column : 14
    <f42>   DW_AT_type        : <0xf78>
    <f46>   DW_AT_data_member_location: 16
 <2><f47>: Abbrev Number: 18 (DW_TAG_member)
    <f48>   DW_AT_name        : (indexed string: 0xdbe): rand_type
    <f4a>   DW_AT_decl_file   : 13
    <f4b>   DW_AT_decl_line   : 428
    <f4d>   DW_AT_decl_column : 9
    <f4e>   DW_AT_type        : <0xac>
    <f52>   DW_AT_data_member_location: 24
 <2><f53>: Abbrev Number: 18 (DW_TAG_member)
    <f54>   DW_AT_name        : (indexed string: 0x875): rand_deg
    <f56>   DW_AT_decl_file   : 13
    <f57>   DW_AT_decl_line   : 429
    <f59>   DW_AT_decl_column : 9
    <f5a>   DW_AT_type        : <0xac>
    <f5e>   DW_AT_data_member_location: 28
 <2><f5f>: Abbrev Number: 18 (DW_TAG_member)
    <f60>   DW_AT_name        : (indexed string: 0xc21): rand_sep
    <f62>   DW_AT_decl_file   : 13
    <f63>   DW_AT_decl_line   : 430
    <f65>   DW_AT_decl_column : 9
    <f66>   DW_AT_type        : <0xac>
    <f6a>   DW_AT_data_member_location: 32
 <2><f6b>: Abbrev Number: 18 (DW_TAG_member)
    <f6c>   DW_AT_name        : (indexed string: 0x9cc): end_ptr
    <f6e>   DW_AT_decl_file   : 13
    <f6f>   DW_AT_decl_line   : 431
    <f71>   DW_AT_decl_column : 14
    <f72>   DW_AT_type        : <0xf78>
    <f76>   DW_AT_data_member_location: 40
 <2><f77>: Abbrev Number: 0
 <1><f78>: Abbrev Number: 20 (DW_TAG_pointer_type)
    <f79>   DW_AT_byte_size   : 8
    <f7a>   DW_AT_type        : <0x645>
 <1><f7e>: Abbrev Number: 17 (DW_TAG_structure_type)
    <f7f>   DW_AT_name        : (indexed string: 0x790): drand48_data
    <f81>   DW_AT_byte_size   : 24
    <f82>   DW_AT_decl_file   : 13
    <f83>   DW_AT_decl_line   : 490
    <f85>   DW_AT_decl_column : 8
    <f86>   DW_AT_sibling     : <0xfcd>
 <2><f8a>: Abbrev Number: 19 (DW_TAG_member)
    <f8b>   DW_AT_name        : __x
    <f8f>   DW_AT_decl_file   : 13
    <f90>   DW_AT_decl_line   : 492
    <f92>   DW_AT_decl_column : 24
    <f93>   DW_AT_type        : <0xfcd>
    <f97>   DW_AT_data_member_location: 0
 <2><f98>: Abbrev Number: 18 (DW_TAG_member)
